[
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer Backend",
        "company": "Paytm Money",
        "place": "Bengaluru, Karnataka, India",
        "date": "2020-09-24",
        "description": "Responsibilities Design, code, debug and test various functions Produce functional specifications and design documents Support and maintain developed code through system test and customer deployments Contribute to overall product requirements and design Complete defined tasks independently and actively help others Improve team productivity Requirements 1+ years of development exposure to Fintech products space Deeply technical with a track record of successful delivery as an individual contributor Strong understanding of CS Fundamentals, Algorithms and Data Structures Able to create high quality code which is testable and maintainable Great problem-solving skills Excellent team skills Master's or Bachelor's degree in Computer Science Show moreShow less",
        "jobBackTechs": [
            "C++"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [
            "JavaScript"
        ],
        "techTypeFront": true,
        "jobDevopsTechs": [
            "Bash"
        ],
        "techTypeDevops": true,
        "link": "https://in.linkedin.com/jobs/view/software-engineer-backend-at-paytm-money-2218507865?refId=77035341-35b5-4dba-888d-4625274f4954&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Computer Software, Information Technology and Services, Internet"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer, Backend",
        "company": "Slack",
        "place": "Pune, Maharashtra, India",
        "date": "2020-10-19",
        "description": "Software Engineer, Backend Slack is looking for Backend Engineers to build features, design and implement API methods, and improve the performance and reliability of our systems as we rapidly scale our product and organization. We build our app using reliable tools that our team knows and trusts, including PHP/Hack, Java, MySQL, and Linux. Expertise in these areas is a huge plus, but having familiarity with other common web languages (such as Python or Ruby) and other relational databases are fine substitutes. We’re a collaborative team who genuinely enjoys working together with a cross-functional team of product managers, designers, frontend, iOS, Android, automation, and quality engineers to make Slack a better product. We are looking for engineers that understand that simplicity and reliability are aspects of a system to be carefully calculated with every decision made. A Taste Of Our Scale And Reach Users spend over 10 hours connected and 2+ hours active in Slack every work day. 10M+ Daily Active Users in more than 150 countries. 1.5 billion messages are sent per month, half of those outside the United States. Every day we see over 3.5 million simultaneously connected users, over 3.5 billion web requests, over 42 billion database queries per day, and our systems see over 1 million queries/second in our caching tier. We have 8.8M+ app installations with 155,000 weekly active developers building on the developer platform. 90% of our paid teams on Slack actively use apps. Slack has a positive, diverse, and supportive culture—we look for people who are curious, inventive, and work to be a little better every single day. In our work together we aim to be smart, humble, hardworking and, above all, collaborative. If this sounds like a good fit for you, why not say hello? What You Will Be Doing You'll brainstorm with Product Managers, Designers, Backend, and Frontend Engineers on your team to conceptualize and build new features for our large (and growing!) user base. You’ll produce high-quality results by contributing heavily to team projects that have a significant impact on the business. You’ll actively own team features or systems and define their long-term health, while also improving the health of surrounding systems. You'll assist our skilled support team and operations team in triaging and resolving production issues. You'll mentor other engineers and deeply review code. You’ll improve engineering standards, tooling, and processes What You Should Have You’ve been building web applications professionally for 2+ years. You have experience with functional or imperative programming languages -- e.g., PHP, Python, Ruby, Go, C, or Java. You can contribute to technical architecture discussions and help drive technical decisions within your team. You write understandable, testable code with an eye towards maintainability. You are a strong communicator. Explaining complex technical concepts to designers, support, and other engineers is no problem for you. You possess strong computer science fundamentals: data structures, algorithms, programming languages, distributed systems, and information retrieval. You have completed a bachelor's degree in Computer Science, Engineering or related field, or equivalent training, fellowship, or work experience. Slack is a layer of the business technology stack that brings together people, data, and applications – a single place where people can effectively work together, find important information, and access hundreds of thousands of critical applications and services to do their best work. From global Fortune 100 companies to corner markets, businesses and teams of all kinds use Slack to bring the right people together with all the right information. Slack is headquartered in San Francisco, CA and has offices around the world. For more information on how Slack makes teams better connected, visit slack.com. Ensuring a diverse and inclusive workplace where we learn from each other is core to Slack’s values. We welcome people of different backgrounds, experiences, abilities and perspectives. We are an equal opportunity employer and a pleasant and supportive place to work. Come do the best work of your life here at Slack. Slack has transformed business communication. It’s the leading channel-based messaging platform, used by millions to align their teams, unify their systems, and drive their businesses forward. Only Slack offers a secure, enterprise-grade environment that can scale with the largest companies in the world. It is a new layer of the business technology stack where people can work together more effectively, connect all their other software tools and services, and find the information they need to do their best work. Slack is where work happens. Ensuring a diverse and inclusive workplace where we learn from each other is core to Slack’s values. We welcome people of different backgrounds, experiences, abilities and perspectives. We are an equal opportunity employer and a pleasant and supportive place to work. Come do the best work of your life here at Slack. Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C++",
            "PHP",
            "Python"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [
            "Ruby",
            "MySQL",
            "Linux"
        ],
        "techTypeDevops": true,
        "link": "https://in.linkedin.com/jobs/view/software-engineer-backend-at-slack-2193819067?refId=77035341-35b5-4dba-888d-4625274f4954&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Part-time",
        "industries": "Information Technology and Services, Computer Software, Internet"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer - TikTok Backend",
        "company": "TikTok",
        "place": "Mountain View, CA",
        "date": "2020-10-14",
        "description": "Responsibilities 1. Develop large-scale software systems that powers TikTok app; 2. Improve system design and architecture to ensure high stability and performance of the services; 3. Collaborate with multiple cross-functional teams to deliver high quality work in rapid product development. Qualifications 1. BS/MS Degree in Computer Science or related major, with 2-5+ year working experience; 2. Experienced in building backend services for large-scale consumer-facing applications; 3. Proficient in at least one of following languages: Java, Go, C++, Python, Java; 4. Deep understanding of computer architectures, data structures and algorithms; 5. Have good team communication and collaboration skills. Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C++",
            "Python"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [],
        "techTypeDevops": false,
        "link": "https://www.linkedin.com/jobs/view/software-engineer-tiktok-backend-at-tiktok-2184310476?refId=77035341-35b5-4dba-888d-4625274f4954&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Associate",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Internet"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "Hack with GitHub",
        "place": "Nairobi, Kenya",
        "date": "2020-10-18",
        "description": "The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code. Responsibilities Develop quality software and web applications Analyze and maintain existing software applications Design highly scalable, testable code Discover and fix programming bugs Qualifications Bachelor's degree or equivalent experience in Computer Science or related field Development experience with programming languages SQL database or relational database skills Show moreShow less",
        "jobBackTechs": [
            "C++"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [],
        "techTypeDevops": false,
        "link": "https://ke.linkedin.com/jobs/view/software-engineer-at-hack-with-github-2216704656?refId=77035341-35b5-4dba-888d-4625274f4954&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Computer & Network Security"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "PayPal",
        "place": "Bengaluru, Karnataka, India",
        "date": "2020-09-30",
        "description": "Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 286 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies. Job Description Summary: The primary role of the Engineer is to provide expertise and deliver code for the Personalization platform systems and components. This person is a highly technical, who understands the e-commerce domain very well, and is well versed in the software implementation. PayPal technology stack for the platform include components in java like services, daemons, batches etc. to work, the candidate should be able to work on these stacks with relative ease. An engineer working on this platform will be exposed to some of the most complicated problem to deal with, in terms of technology and business. Personalizing marketing and product use cases is a challenge, and having the ability to do it for the same user in the most efficient way will push the engineer to the limit. Beyond this, the successful candidate is expected to be multi-disciplinary, and is a multi-talented member of the technical team. The individual is expected to be a self-starter and a team player, with a strong drive for results and continuous innovations. The individual should be able to deliver work with minimal supervision. Job Description: Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 210 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies. The consumer organization at PayPal focuses on new products and capabilities offered to the consumer segment of PayPal users. This organization is responsible for all the experiences and services offered to buyers and casual sellers. Some of the areas of focus are P2P payments, Incentives, login dashboard, shopping experience and consumer utilities like contact book and device management. One of the core branches of the consumer organization is the Personalization Platform. This platform’s core KPI is to improve the engagement of PayPal customers with PayPal products and experiences and in the process, increase adoption. There are two critical paths for personalization, Product and Marketing, which translates to the best product experience, personalized for a user at a point in time and the best marketing message personalized for a user. In both the cases, the customer is at the center, to surface the best and the most relevant experiences for them to be pleased with the experience. There are various systems involved, like segmentation platform, personalization platform, channel management etc.; to realize one of these experiences, all these systems work independently to compute massive data and a management platform is used to tie these together. From an integration standpoint, personalization platform is the central decision engine to choose the most relevant message/experience to be surfaced to the end user. This is decided based on various factors like the segment of the user, different message competing with priority ranking, contextual data, frequency of the message rendered, customer interaction metrics etc. This requires the platform to be built with scalable, performant and robust infrastructure to be able to make this decision in few 10 ms. The platform receives ~500 million requests per day which further adds to the complexity in the way the platform needs to be coded. Job Description: The primary role of the Engineer is to provide expertise and deliver code for the Personalization platform systems and components. This person is a highly technical, who understands the e-commerce domain very well, and is well versed in the software implementation. PayPal technology stack for the platform include components in java like services, daemons, batches etc. to work, the candidate should be able to work on these stacks with relative ease. An engineer working on this platform will be exposed to some of the most complicated problem to deal with, in terms of technology and business. Personalizing marketing and product use cases is a challenge, and having the ability to do it for the same user in the most efficient way will push the engineer to the limit. Beyond this, the successful candidate is expected to be multi-disciplinary, and is a multi-talented member of the technical team. The individual is expected to be a self-starter and a team player, with a strong drive for results and continuous innovations. The individual should be able to deliver work with minimal supervision. Responsibilities: Work as full time developer for the team. Must be able to work independently with minimal supervision in a team to implement, test, release rollout and support software applications for PayPal. Work with engineering managers, engineers & QA to develop innovative solutions that meet market needs w.r.t functionality, performance, reliability, realistic implementations schedules and adherence to development goals and principles. Develop new team capabilities to ensure continued competence and relevance in supporting software development needs of PayPal's business. Define and devise processes, tools and methodologies to achieve excellence in software development, testing and deployment. Follow the team processes like Agile etc. Job Requirements: BE in Computer Science or Engineering and 3+ years related industry experience Highly competent hands-on experience in the following: Enterprise software implementation, particularly large-scale web-based systems. (J2EE) Java programming in Linux/Unix environment OO-based analysis and design SOA / Web Services MVC frameworks such as Spring along with Sprint boot. Software design and development methodologies, including Agile methods Source Control (GIT experience is an advantage) Unit testing frameworks such as JUnit, Google Test Database knowledge. (Oracle/MySQL) Scripting Languages (Shell, Python, Perl) would be a plus Jenkins/Hudson, Maven/Ant, RESTs experiences would be a plus Highly analytical, innovative, and able to think strategically and to develop comprehensive detailed specifications. Excellent verbal and writing skills; ability to produce clear, concise communications and documentation. Highly effective at working in cross-functional groups and getting results in matrix organizations. Excellent time management skills and ability to work on concurrent assignments with different priorities Working knowledge of finance industry standards and practices preferred. We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom. PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. REQ ID R0056337 Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C++",
            "Python"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [
            "Express",
            "MySQL",
            "Git",
            "Jenkins",
            "Linux"
        ],
        "techTypeDevops": true,
        "link": "https://in.linkedin.com/jobs/view/software-engineer-at-paypal-2193894820?refId=77035341-35b5-4dba-888d-4625274f4954&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Not Applicable",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Computer Software, Financial Services, Internet"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "Oracle",
        "place": "Seattle, WA",
        "date": "2020-10-19",
        "description": "Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc. As a member of the software engineering division, you will apply basic to intermediate knowledge of software architecture to perform software development tasks associated with developing, debugging or designing software applications or operating systems according to provided design specifications. Build enhancements within an existing software architecture and occasionally suggest improvements to the architecture. Duties and tasks are standard with some variation; displays understanding of roles, processes and procedures. Performs moderately complex problem solving with assistance and guidance in understanding and applying company policies and processes. BS degree or equivalent experience relevant to functional area. 1 year of software engineering or related experience. Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law. Software Engineer, Oracle Container Engine Department Description Oracle Cloud Infrastructure (OCI) combines the elasticity and utility of public cloud with the granular control, security, and predictability of on-premises infrastructure to deliver high-performance, high availability and cost-effective infrastructure services. Multiple compute options provide the flexibility to run the most demanding workloads, as well as less compute-intensive applications, in a secure and highly available cloud environment. Customers can self-service provision virtual machines right alongside bare metal servers and clusters on the same virtual cloud networks, through a unified web console, APIs, CLI or via industry standard tools such as Terraform and Chef. OCI's approach gives the customer choices for storage us industry leading local NVME storage or elastic network block storage. The Oracle Kubernetes Engine (OKE) team builds the OCI service that runs our managed Kubernetes experience. It is in use by a variety of internal and external customers, and we're actively adding features - from Kubernetes, to deeper integrations with OCI, and to better allow cluster management. The team operates a 24x7 service at scale. We have a large roadmap of features to enable scenarios for new customers coming onboard in the coming quarters. Position Overview We’re looking for hands-on engineers with expertise and passion in solving difficult problems in distributed systems, virtualized infrastructure, and highly available services. If this is you, at Oracle you can design and build innovative new systems from the ground up. These are exciting times in our space - we are growing fast, still at an early stage, and working on ambitious new initiatives. An engineer at any level can have significant technical and business impact. The ideal software engineer candidate for this team is a proficient programmer who has large breadth of knowledge and experience including areas such as networking, storage, internet protocols and operating systems. We write distributed, highly available systems to build, update and deploy Kubernetes, plus automation and tooling for testing, deployments and other needs. Responsibilities Architect and design new features and systems for our customers. Work across teams to engineer the best system (both for operations and for customers) regardless of org boundaries or ownership. Debug, maintain and improve existing systems, with a focus especially for reducing operational burden and on performance. Be a generalist, able to debug issues across a wide breadth of our stack. Scale our systems by building tooling and automation. Work with partner teams outside our org and external to Oracle. Qualifications BS degree in Computer Science or related technical field involving coding or equivalent practical experience. 2+ years experience delivering and operating large scale, highly available distributed systems. History of working in large codebases in C/C++, C#, Java, or Go, and experience with scripting languages such as Python, Perl, etc. Strong knowledge of data structures, algorithms, operating systems, and distributed systems fundamentals. Systematic problem-solving approach, strong communication skills, a sense of ownership and drive. Experience building multi-tenant, virtualized infrastructure a strong plus. Job Product Development Travel No Location US-WA,Washington-Seattle Other Locations United States Job Type Regular Employee Hire Organization Oracle Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C#",
            "C++",
            "Python"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [],
        "techTypeDevops": false,
        "link": "https://www.linkedin.com/jobs/view/software-engineer-at-oracle-2219039577?refId=77035341-35b5-4dba-888d-4625274f4954&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Marketing and Advertising, Information Technology and Services, Computer Software"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer - Backend",
        "company": "Postman",
        "place": "Bengaluru, Karnataka, India",
        "date": "2020-10-15",
        "description": "Description Postman is the only complete API development environment. Today we have 11+ million developers and over 500K companies using our comprehensive set of built-in tools to support every stage of the API lifecycle. With Postman you can design, mock, debug, test, document, monitor, and publish your APIs all in one place. About The Team The team works closely with the Product teams to build APIs that enable delightful experiences for developers who build modern software for the API first world. We’re a small team that learns from each other and iterates rapidly to make a large impact. Our Microservices are written in Node.js, MySQL and Linux deployed on the AWS Platform. A Taste Of Our Scale 700k+ daily active users 200+ million requests per day spread across 30+ microservices resting around 20 TB of data ingesting around 2TB of monthly internal service logs 200k+ peak concurrent web socket connections This position reports to one of our Engineering Managers. Responsibilities Build and own microservices while working with a cross-functional team of Product Managers, Designers, Support and Product, Quality, Security and Platform Engineers. Manage the roadmap and SLAs for the microservices that you own. Create and periodically review Architectural diagram for the Microservices and manage their dependencies. Perform Code reviews. Deploy and monitor versions, retire older versions and push patch fixes. Manage Mocks, Docs, Monitors, Integration and Contract Tests using Postman. On-board, mentor and off-board developers within the Microservices you own. Requirements You’ve been building web applications for 3+ years. You’ve experience with high level programming languages - e.g. Node.js, PHP, Python, Ruby, Go. We code primarily in Node.js, so you’ll be excited to either ramp up on that or continue building awesome things with it. You possess strong Computer Science fundamentals - Algorithms, Databases, Networking and Distributed systems. You write testable, maintainable code that’s easy to understand. You are a strong communicator who can explain complex technical concepts to product managers, designers, support and other engineers. You enjoy helping onboard new team members, mentoring, and teaching. You have curiosity about how things work. Benefits This position will be located in our beautiful office at 100 ft road, Indiranagar in Bangalore. You will enjoy our incredible perks: home-cooked meals, snacks, game room, flexible hours, ergonomic workstations and cuddles from our endearing Chief Happiness Officer, Cooper.What you will also get to experience is a company that believes in autonomous small teams for maximum impact; that strives for organizational growth to align with that of the individual; that continuously and purposefully builds an inclusive culture where everyone is able to do and be the best version of themselves and where ideas are encouraged from anyone and everyone. We seek people who naturally demonstrate our values, who not only understand the challenge but can also solve this for the rest of the world. Be a part of something big. Show moreShow less",
        "jobBackTechs": [
            "C++",
            "PHP",
            "Python"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [
            "Ruby",
            "MySQL",
            "AWS",
            "Linux"
        ],
        "techTypeDevops": true,
        "link": "https://in.linkedin.com/jobs/view/software-engineer-backend-at-postman-2208977267?refId=77035341-35b5-4dba-888d-4625274f4954&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Information Technology and Services, Computer Software, Internet"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "JPMorgan Chase & Co.",
        "place": "Hyderabad, Telangana, India",
        "date": "2020-10-19",
        "description": "JPMChase ES – Arrangement & Financial Processing is looking for talented and highly motivated self driven and a solution provider to lead application development teams. This position will offer exciting opportunities to be part of transformation journey involving - cloud migration, adoption of microservices, event driven architecture, fast tracking API development Skill Set/ Capabilities/Strengths - Experience working In Banking Domain and specifically on Core Banking Domain in Retail - Excellent analytical, communication, organizational and problem-solving skills coupled with a strong work ethic - Excellent knowledge in developing large scale applications using Java, J2EE, spring, spring boot and ORM technologies like hybernate - Experience with full development lifecycle from inception through implementation - Understanding of JAVA and Cloud ( Public /Private) and concepts of PaaS/IaaS is required - Excellent knowledge in developing microservices - Exposure to event driven programming using kafka - Solution driven attitude and multitasker - Exposure to public and private cloud - Good Knowledge in CI/CD - Experience with Agile methodologies (SCRUM) Qualifications - Bachelor’s or graduate degree in Computer Science or related field - Minimum 4+ years of professional working experience Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C++"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [],
        "techTypeDevops": false,
        "link": "https://in.linkedin.com/jobs/view/software-engineer-at-jpmorgan-chase-co-2192255845?refId=77035341-35b5-4dba-888d-4625274f4954&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Information Technology and Services, Management Consulting, Financial Services"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "Airbnb",
        "place": "Beijing, Beijing, China",
        "date": "2020-10-13",
        "description": "About Airbnb Airbnb is one of the world’s largest marketplaces for unique, authentic places to stay and things to do, offering over 7 million accommodations and 40,000 handcrafted activities, all powered by local hosts. An economic empowerment engine, Airbnb has helped millions of hospitality entrepreneurs monetize their spaces and their passions while keeping the financial benefits of tourism in their own communities. With more than half a billion guest arrivals to date, and accessible in 62 languages across 220 countries and regions, Airbnb promotes people-to-people connection, community and trust around the world. About Airbnb China As an independent business unit, China is one of the major engines behind Airbnb's global growth. The company has increased its investment in China and experienced rapid growth since officially entering the market at the end of 2015. Airbnb continues to focus on product localization and innovation to better serve local users and enhance the user experience, nurture a trusting local community, and engage Chinese Millennial travelers with inspiring brand moments. As one of the leaders in the home sharing industry, Airbnb works with partners across many fields to actively promote the sustainable development of this emerging industry and achieve win-win results for everyone. Airbnb will continue to build an efficient local team, bringing the end-to-end, authentic travel experience to Chinese travelers, and creating a world where \"anyone can belong anywhere\". About The Engineering Team China is one of the largest and fastest growing travel markets and a critical piece to Airbnb's mission. Here we want to build a localized product team that best serves Chinese users and market, enabling everyone to truly \"belong anywhere\". We are now looking for talented software engineers to join the team, to help us build a strong and fast feedback loop, and adapt our products according to local needs. You will have the chance to thrive on a global platform empowered by deep and localized innovations while building a unique experience for Chinese users. 爱彼迎公司简介 爱彼迎是全球领先的特色住宿和体验项目预订平台，提供700多万个独具当地特色的住宿选择和4万项精心策划的体验活动，均由当地房东和体验达人倾力打造。作为赋能经济发展的引擎之一，爱彼迎正在帮助数以百万计的旅游服务创业者将房源和爱好转化为收入，也让当地社区享受到了旅游业带来的经济效益。迄今为止，爱彼迎已接待超过5亿人次房客，在全球220个国家和地区提供62种语言服务。爱彼迎致力于在全球范围内促进人与人之间的交流和信任，打造充满人情味的社区。 爱彼迎中国简介 作为一个独立的业务部门，中国是Airbnb爱彼迎全球增长的重要引擎之一。自2015年底正式进入中国起，爱彼迎在中国市场不断加大投入，实现了持续快速增长。爱彼迎将持续升级本土产品，打造创新的品牌活动，提升用户体验，构建有凝聚力的社区。作为共享住宿行业的领军者之一，爱彼迎还携手各方，积极推动这一新兴行业的可持续发展，实现多方共赢。我们将继续打造高效的本土团队，将原汁原味的旅行体验带给中国旅行者，创造“家在四方”的归属感，重新定义旅行。 关于爱彼迎工程团队 中国是世界上最大也是发展最快的旅游市场，同时也是爱彼迎「家在四方」愿景的重要组成部分。我们的中国工程团队希望通过打造本土化的团队和产品来更好的服务中国的用户，实现我们的愿景。 现在我们需要像你这样的优秀工程师的加入，来帮助我们打造更快更好的产品业务流程，迭代速度，和本地化体验。如果你想拥有世界级的平台，来发挥你的聪明才干，让你的亲朋好友直接使用到你参与实现的本土化产品和体验，还等什么呢？ 工作内容 负责 Airbnb 中国爬虫/反爬虫相关业务的构架设计、搭建和开发 维护和迭代现有相关爬虫类业务需求 参与Foundation相关项目 职位要求 本科及以上相关学历，3年以上爬虫/反爬虫经验，旅游/OTA行业爬虫/反爬虫经验优先 熟练掌握爬虫相关的技术和框架 扎实的程序设计和架构基本功 积极主动，有良好的沟通能力和快速学习能力 Show moreShow less",
        "jobBackTechs": [
            "C++"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [],
        "techTypeDevops": false,
        "link": "https://cn.linkedin.com/jobs/view/software-engineer-at-airbnb-2181310052?refId=77035341-35b5-4dba-888d-4625274f4954&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Not Applicable",
        "jobFunction": "Research, Engineering",
        "employmenttype": "Full-time",
        "industries": "Hospitality, Internet, Leisure, Travel & Tourism"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "Nielsen",
        "place": "Chennai, Tamil Nadu, India",
        "date": "2020-10-19",
        "description": "Job Description MID ENGINEER - FULL STACK , CHENNAI About This Job In Nielsen Technology, we process over 250 terabytes of data every single day, manage it in the latest cloud technology, and build best-in-class analytical tools to add transparency and efficiency to the consumer goods market at a scale that no other company is able to achieve. We’re looking for a Product Manager. - drive strategy and delivery of Connect Platform, which is the future of the entire Nielsen Connect ecosystem. Responsibilities Write complex code to develop scalable, flexible and user-friendly applications across the full stack of technologies. Develop secure and highly performant services and APIs. Use distributed computing to validate and process large volumes of data to deliver insights. Evaluate technologies we can leverage, including open-source frameworks, libraries, and tools. Ensure the maintainability and quality of code. Mentor other engineers on code development, providing technical leadership guidance as the SME. a Little Bit About You You’re a passionate, analytical, innovative Senior Engineer who wants to figure out how to measure things in a complex world. You have a passion for building top-notch, scalable products and have full-stack experience. Qualifications A Bachelor’s or Master’s degree in Computer Science or related field. 4.5+ years of software development experience with 3+ years as a full stack developer. Relevant Experience in Spring boot, Microservices and angular/angularjs Excellent knowledge of data structures, algorithms and designing for performance scalability and availability. Advanced knowledge and working experience on Java, spring boot and Angular Strong knowledge and experience with SQL or relational databases Strong experience in designing and building multithreaded distributed systems Experience in agile software development practices and DevOps About Nielsen We’re in tune with what the world is watching, buying, and everything in between. If you can think of it, we’re measuring it. We sift through the small stuff and piece together big pictures to provide a comprehensive understanding of what’s happening now and what’s coming next for our clients. Today’s data is tomorrow’s marketplace revelation. We like to be in the middle of the action. That’s why you can find us at work in over 100 countries. From global industry leaders to small businesses, consumer goods to media companies, we work with them all. We’re bringing in data 24/7 and the possibilities are endless. See what’s next with us at Nielsen Additional Information ABOUT NIELSEN We’re in tune with what the world is watching, buying, and everything in between. If you can think of it, we’re measuring it. We sift through the small stuff and piece together big pictures to provide a comprehensive understanding of what’s happening now and what’s coming next for our clients. Today’s data is tomorrow’s marketplace revelation. We like to be in the middle of the action. That’s why you can find us at work in over 100 countries. From global industry leaders to small businesses, consumer goods to media companies, we work with them all. We’re bringing in data 24/7 and the possibilities are endless. See what’s next with us at Nielsen: careers.nielsen.com Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C++"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [
            "AngularJS"
        ],
        "techTypeFront": true,
        "jobDevopsTechs": [
            "Express"
        ],
        "techTypeDevops": true,
        "link": "https://in.linkedin.com/jobs/view/software-engineer-at-nielsen-2193867046?refId=77035341-35b5-4dba-888d-4625274f4954&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Marketing and Advertising, Information Technology and Services, Internet"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer - Commerce Platform",
        "company": "Evernote",
        "place": "San Diego, CA",
        "date": "2020-10-20",
        "description": "About The Team The Commerce Platform team is responsible for building services that enable seamless customer payments to drive growth for the business. Additionally, the team builds and maintains product features that help improve transparency, control, and accuracy of subscription information for our customers. What You'll Do Work closely with Product Managers and Client Teams to build features that make payments easy, seamless, and secure for our customers Actively own features and/or systems and define their long term health Improve engineering standards, tooling, and processes Basic Qualifications BS in Computer Science or related field of study. 3+ years of experience programming in Java, C#, or other modern programming languages Consistently delivered high-quality software in a timely manner Preferred Qualifications Designed and built microservices with a focus on scale, reliability, availability Familiarity with containerization using Docker or similar technologies Past experience with Billing platforms and services (Zuora, Braintree, PayPal), multi-currency, payment processing, subscription Deployed software in Google, AWS, Azure, or similar cloud-native technologies We are committed to an inclusive and diverse Evernote. We believe that different perspectives lead to better ideas, and better ideas allow us to better understand the needs and interests of our diverse, global Evernote Community. We welcome people of different backgrounds, experiences, abilities and perspectives and are an equal opportunity employer. California privacy notice: Read our privacy policy for job applicants here. Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C#",
            "C++"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [
            "AWS",
            "Azure",
            "Docker"
        ],
        "techTypeDevops": true,
        "link": "https://www.linkedin.com/jobs/view/software-engineer-commerce-platform-at-evernote-2194821817?refId=77035341-35b5-4dba-888d-4625274f4954&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Information Technology and Services, Computer Software, Internet"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer - Fintech",
        "company": "Traveloka",
        "place": "Jakarta, Indonesia",
        "date": "2020-10-12",
        "description": "The Financial Services group at Traveloka covers Paylater, Insurance and Payments, along with a few emerging business units. Software engineering takes the central roles for building Traveloka products and systems. You will be responsible for designing, building, improving, or maintaining our web applications, third-party data integration, data API, backend systems, or working with monitoring tools and infrastructure. You may work on our search engine including scoring and relevance, reservation engine, automated pricing engine, business process engine, data applications, devops-related applications, and other new projects. You will work in cross-functional teams and meet great people regularly from top tier technology, consulting, product, or academic background. We work in open environment where there are no boundaries or power distance. Everyone is encouraged to speak their mind, propose ideas, influence others, and continuously grow themselves. Get the exposure to multi-aspect, collaborative, intensive startup experience with our recent expansion into Southeast Asia and exploration of new products. You will be exposed to several advanced technologies such as search engine including scoring and relevance, reservation engine, automated pricing engine, business process engine, data applications, devops-related applications, new projects or tech initiatives and many more. Qualifications Having minimum 3 years of experience in software engineering, application development or system development Passion in software engineering, application development, or systems development Excellent understanding of software engineering concepts, design patterns, and algorithms Comfortable working up and down the technology stack Curiosity to explore creative solutions and try new things Bachelors' degree in Computer Science or equivalent from a reputable university Show moreShow less",
        "jobBackTechs": [
            "C++"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [],
        "techTypeDevops": false,
        "link": "https://id.linkedin.com/jobs/view/software-engineer-fintech-at-traveloka-2176697015?refId=77035341-35b5-4dba-888d-4625274f4954&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Associate",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Internet"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "software development engineer I",
        "company": "Starbucks",
        "place": "Seattle, WA",
        "date": "2020-10-19",
        "description": "Job Summary And Mission At Starbucks, our mission is to inspire and nurture the human spirit - one person, one cup, and one neighborhood at a time. Starbucks Technologists work to achieve this mission through the use of cutting-edge technology delivered to our customers, stores & partners. This job contributes to Starbucks success by delivering a suite of tools and services to unlock testing opportunities for our internal customers. We are seeking to create a unified set of tools for all of Starbucks technology to leverage. Our automation tools currently run 100s of thousands of tests daily and protect our most important customer scenarios including Mobile Order and Pay, Loyalty, and Payments. If you are passionate about quality and developing cutting edge tools, then we want to hear from you! Summary Of Key Responsibilities Design & develop APIs, Data storage and UI to enable deeper and more comprehensive testing across all of Starbucks Tech Establish cross-functional, collaborative relationships with business and technology partners Analyze data, provide insights, and communicate findings to peers and customer teams Conduct research and make recommendations on improvements to systems, tools, and processes Champion deeper automation capabilities across our broader teams & systems, to keep providing better success and forensic capabilities from existing automation data Basic Qualifications Bachelor’s degree in computer science or related discipline Basic proficiency in one programing language such as C#, Java, or C++ Knowledge of object-oriented design, design patterns, and programming skills Preferred Qualifications Preferred Experience (or Capstone projects) with: Designing and developing distributed systems Introduction to Database and/or data storage Machine learning, predictive modeling or statistical techniques for data analysis React / React Native Starbucks and its brands are an equal opportunity employer of all qualified individuals. We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply. Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at 206-318-0660 or via email at applicantaccommodation@starbucks.com Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C#",
            "C++"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [
            "ReactJS"
        ],
        "techTypeFront": true,
        "jobDevopsTechs": [],
        "techTypeDevops": false,
        "link": "https://www.linkedin.com/jobs/view/software-development-engineer-i-at-starbucks-2193818269?refId=77035341-35b5-4dba-888d-4625274f4954&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Not Applicable",
        "jobFunction": "Information Technology, Engineering",
        "employmenttype": "Full-time",
        "industries": "Consumer Goods, Food & Beverages, Retail"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "Drip",
        "place": "Greater Minneapolis-St. Paul Area",
        "date": "2020-10-19",
        "description": "Drip is the world’s first ecommerce CRM (ECRM) that enables retailers to build personal and profitable relationships with their customers at scale. We believe the world needs specialty retail and Drip is the platform that enables competition with the impersonal ecommerce giants. We are well-funded, growing super fast, and building a beautiful product. We have offices in Minneapolis and Greater Salt Lake City. www.drip.com/about Want to positively impact tens of thousands of passionate users and marketing professionals around the globe? Join Drip! About the opportunity As a Software Engineer at Drip, you’ll be part of a small, agile product team that is working to solve some of the industry’s most interesting technical challenges. You’ll collaborate cross-functionally as you design, build, and ship production features for our cloud-native ECRM application. In addition to gaining experience in a rapidly evolving SaaS start-up, you’ll have a tremendous impact on the product: literally shaping and defining this new CRM vertical. About the tech stack We use a variety of different technologies to best meet the needs of our customers. While our code runs in AWS, we deploy and manage services written in Ruby, Go, Python, and Scala (just to name a few). Our frontend team loves building user experiences in Elm, while our backend team likes to build microservices (Dockerized on ECS) that scale to thousands of requests per second. For data, we share the love for both relational and NoSQL databases: PostgreSQL, DyanamoDB, Redshift, and Athena. Monitoring, operational excellence, and testing are important to all of us as we continually strive to improve. Goals for you! Our goal is to be successful at the company and individual level. Within 180 days of being at Drip, you will have... ...completed a comprehensive onboarding plan where you’ll get to know all of the key leaders, understand how the Company, Customer, Product, and People machines work and have a deep knowledge of our strategy and product (this will happen quickly!) ...deep familiarity with our tech stack and codebase through pair programming and immediately owning a feature ...had a major, visible, impact on our product in a way that directly and tangibly impacts our customers ...ownership of major features of the product Your Profile You’re a self-starting engineer who loves technology! You have experience in building either complex SaaS applications or B2C sites; ideally both, as our Drip engineering team stretches in both directions. You also have experience architecting scalable applications including microservices. Sound like you? We consider working for a successful early-stage tech company to be a lifestyle choice rather than a job choice. You will work hard and face exciting challenges, but our positions come with amazing advantages and fulfillment to those who earn them. If you bring your best self to the table, we'll bring some great stuff in return. Drip is an inclusive workplace that upholds the dignity of all people. We value, respect, and celebrate everyone’s individualities and honor their unique strengths from all different walks of life. We embrace diversity of perspective and ideas which leads to people’s growth, product innovation and ultimately a successful business. Show moreShow less",
        "jobBackTechs": [
            "C++",
            "Python"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [
            "Ruby",
            "PostgreSQL",
            "AWS",
            "Docker"
        ],
        "techTypeDevops": true,
        "link": "https://www.linkedin.com/jobs/view/software-engineer-at-drip-2193857790?refId=77035341-35b5-4dba-888d-4625274f4954&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Computer Software"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer, Software Platform (New Grad)",
        "company": "Robinhood",
        "place": "Menlo Park, CA",
        "date": "2020-10-16",
        "description": "About The Company Robinhood is democratizing finance for all. With customers at the heart of our decisions, Robinhood is lowering barriers, removing fees, and providing greater access to financial information. Together, we are building products and services that help create a financial system everyone can participate in. Robinhood is a fast-growing company and was recognized as a CNBC Disruptor 50 and a LinkedIn Top Startup in 2019. We’re continuing to grow and are looking for incredible talent that can help us achieve our mission. Robinhood is headquartered in Menlo Park, California, with offices in Lake Mary, Florida, Denver, Colorado, and London, UK. About The Role The Software Platform team strives to accelerate developer velocity and increase system stability by building the foundational software platforms and tools that power the rest of Robinhood engineering. We’re looking for driven software engineers who are excited by the opportunity to own mission-critical infrastructure, and are passionate about amplifying their impact by improving the reliability, scalability, and usability of the infrastructure and tools at Robinhood. Your Day-to-day Will Involve Working with a dedicated mentor to ramp up on infrastructure at Robinhood Building, deploying, and augmenting tools and systems that provide core technical capabilities across all Robinhood microservices Diagnosing and driving fixes for performance and reliability issues that emerge at scale Participating in the design and execution of large initiatives to unlock new capabilities and paradigms for Robinhood microservices Some Things We Consider Critical For This Role Must be currently enrolled in a full-time, degree-seeking program with an expected graduation date in 2021 Solid CS fundamentals, ideally with coursework or experience in distributed systems, operating systems, and networking Grit and tenacity to dive into novel systems and technologies, identifying problems and building impactful solutions Interest in building software to help other engineers, eliminating pain points, improving quality/stability, and reducing toil Bonus Points Prior internship or project experience where you dove into cloud infrastructure (e.g. AWS) or developer tools Technologies We Use Go, Python/Django as the main languages and frameworks of choice AWS, Kubernetes, Hashicorp Vault, Terraform, SaltStack, Jenkins Consul, Unbound, nginx, gRPC Prometheus, Grafana, statsd, Jaeger, Sentry, pganalyze, ELK Kafka, Zookeeper, RabbitMQ, Celery PostgreSQL, Elasticsearch, DynamoDB, Redis, Memcached Feeling ready to give 100% to democratizing finance for all? We’d love to have you apply, even if you feel unsure about whether you meet every single requirement in this posting. At Robinhood, we’re looking for people invigorated by our mission, not just those who simply check off all the boxes. The role associated with the above job description is subject to possible modification due to the shelter-in-place restrictions as a result of the pandemic. Show moreShow less",
        "jobBackTechs": [
            "C++",
            "Python"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [
            "Django",
            "PostgreSQL",
            "AWS",
            "Jenkins",
            "NGINX"
        ],
        "techTypeDevops": true,
        "link": "https://www.linkedin.com/jobs/view/software-engineer-software-platform-new-grad-at-robinhood-2187526176?refId=77035341-35b5-4dba-888d-4625274f4954&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Information Technology and Services, Computer Software, Financial Services"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "Toyota Connected North America",
        "place": "Plano, TX",
        "date": "2020-10-15",
        "description": "Toyota Connected’s Mobility team is responsible for building and managing our connected vehicle platforms, supporting product research using vehicle sensor data and creating new and exciting data services for Toyota customers that makes driving safer, more convenient, and fun. We are looking for a Software Engineer like you to help develop, validate and deploy complex cloud-based products at Toyota Connected. We are creating the next generation vehicle telematics and safety services platform to tackle super complex data, connectivity, and service delivery challenges that emerge when you have millions of people driving globally that demand immediate access to contextual and relevant information. Responsibilities: Operate in a highly-iterative Agile development environment Engineer efficient, adaptable and scalable microservice architectures in the cloud to process, store and expose unstructured big data Think independently to solve difficult data problems Work closely with product owners and other team members to deliver next generation connected car data services Monitor performance and provide advice for any necessary infrastructure changes Qualifications: You have programming expertise in Java and/or Scala You have production experience with Spring Boot and similar frameworks Experience with building micro-service based architectures Experience in one or more modern database technologies Working experience and good understanding of public cloud environments such as AWS, Azure, and/or Google Cloud Experience building near real-time streaming applications is a plus Experience with cloud infrastructure and Infrastructure as code such as Terraform or CloudFormation is a plus Experience building CI/CD pipelines is a plus Experience deploying applications with Kubernetes is a plus Experience with serverless architecture is a plus We think the knowledge acquired earning an BS in Computer Science, Engineering, Mathematics, or a related field would be of great value in this position, but if you're smart and have the experience that backs up your abilities, for us, talent trumps degree every time What’s in it for you? In addition to an excellent compensation and benefits package, you’ll also receive: A Career Path that allows you to take your career to the next level. Annual $2,000 Training Budget to help you grow and develop. Unlimited time off and flexibility for a great worklife balance. At TC you'll be treated like the professional we know you are and left to manage your own time and work load. Four months of paid parental leave. We want new moms and dads to have an opportunity to bond with their new little bundles of joy. 401(k) with generous company match that is fully vested Day One. Toyota and Lexus vehicle discounts to allow you to drive in style. Annual Patent-a-thons and Hackathons to embrace your superior creative thinking ability. Annual gym membership reimbursement. We have a Toyota Connected fit club that loves plank competitions! Free catered lunches every day. We try to keep it healthy, but Fridays are “cheat” days, so you can get your carbs on! Two fully stocked Nespresso bars for your coffee and tea fixes. Stocked kitchens with healthy snacks including fresh fruit, almonds, mixed nuts, pretzels, trail mix, and flavored waters. Nobody is hangry here! Fun game room for the gamer that lives inside you! Xbox, virtual reality, and Nintendo Switch gamers live here and are always ready for their next opponent. No dress code! Come as you are. We know the smart people we hire don’t need to be told what to wear. Free covered garage parking to shield your vehicle from those sneaky storms and to protect your buns from the Texas sun. Who Are We? Toyota Connected is a new company created to infuse the power of big data and cloud intelligence into all aspects of the mobility experience so that driving a Toyota or Lexus is more personal, intuitive and safe. We create and enable technologies that delight, simplify and connect the lives of those who use our products. We believe this mobility revolution will empower our customers to use their vehicles in an array of exciting new ways. We support, celebrate and thrive on the opportunity to provide Mobility for All. Making a connected life a more human experience takes humans from all walks of life. Toyota Connected celebrates and is committed to a diverse and inclusive workplace that embraces you regardless of your gender, religion, sexual orientation, skin color, age, disability, military or veteran status, big shot relative, or Instagram fame. Different makes us awesome. Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C++"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [
            "AWS",
            "Azure"
        ],
        "techTypeDevops": true,
        "link": "https://www.linkedin.com/jobs/view/software-engineer-at-toyota-connected-north-america-2209806537?refId=77035341-35b5-4dba-888d-4625274f4954&position=16&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Mid-Senior level",
        "jobFunction": "Information Technology",
        "employmenttype": "Full-time",
        "industries": "Information Technology and Services, Information Services, Automotive"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "KeyReply",
        "place": "Singapore, Singapore",
        "date": "2020-10-19",
        "description": "About KeyReply KeyReply is enterprise conversation AI platform with knowledge management and customer service automation capabilities. We serve large private, public healthcare providers and insurance companies. Our Clients include the Ministry of Health, Singapore, National Heart Centre, KK Women’s and Children’s Hospital, Parkway Hospitals, AIA and many more. These organizations have multiple stakeholders, knowledge bases and divisions with many segmented teams providing customer and staff facing support. Where being able to find information and carry out key transactions and enquiries 24/7 can result in a huge competitive advantage for revenue, customer satisfaction and operational excellence. KeyReply intelligently searches through thousands of pages of information. The platform also connects to multiple backend systems to give the customer exactly what they need 24/7, through an intuitive chat format. These enable end to end transactions and cross knowledge domain QnA, that enables customer service turnaround time to be improved by 95%, and speed up information retrieval by more than 3x. Why join KeyReply? · We solve difficult problems that are very meaningful. Healthcare organizations around the world are now planning for what post-covid-19 will look like. What does a smart hospital look like? What changes should they make for Healthcare 2.0? · By being more nimble in the way of delivering care – in person or remote; moving from reactive to proactive and preventive care; empowering patients to make informed first-level decisions on their next course of actions; and more efficient resource allocation, we can positively impact the lives of millions in very tangible ways. · We are proud to work with some of the largest and most well-respected healthcare institutions. Your work will be used prominently by millions to improve the future of patient engagement. · Lead the innovation in Healthcare and Insurance by joining KeyReply today. Perks and Benefits: · Unique opportunity: Be a part of the digital disruption in #1 AI chat automation company. Exposure to the fast-paced world of high-tech start-ups. · Autonomy: Autonomy in the role and in managing your own portfolio and freedom to suggest improvements to the company. · Environment: Working with passionate, smart and driven colleagues in a vibrant environment. Team activities, snacks, games, outings etc · Flexibility: Flexible vacation policy and work arrangements · Attractive Package: Competitive salaries and medical benefits. Software Engineer (Full-Stack) By joining us, you will be at the forefront of developing technology that will empower the next breed of enterprises, and working with these companies who care deeply about their customers. Your impact will not only be on streamlining and improving efficiency within these enterprises, but also on delivering the perfect interaction to their end user and driving customer satisfaction. We are genuine, down to earth, hard workers; we don't just care about how we can have fun together, we care about how we can help each other grow and become a best-in-class individual, as much as we care about being the best-in-the-world business. Key Responsibilities Take responsibility within an engineering team that builds and supports amazing customer-facing products, providing innovative solutions to challenging programming and design problems. Accurately scope effort, identify risks and clearly communicate trade-offs with team members and other stakeholders; sometimes this includes clients, if you need to. Stay aware of industry trends, confidently make technology choices and strategic decisions. Ship high quality products and features with an end-to-end mind set from conception to delivery and production support, owning specifications, quality, release deployments and monitoring of production health. Self-driven and care about maintainability of code, automation, deployment processes, and want to write the highest quality code with utmost attention to scalability and performance. Skills & Experience required 3+ years of experience designing and developing applications Experience working most of the following: VueJS, ReactJS, Node.js, TypeScript, GraphQL, MySQL/Postgres/MSSQL, WebSocket Experience and adamant in creating well thought-out applications that have reusable components, readable code, resilient design, low maintenance, computational efficiency, modular and future-proof (i.e. easy to modify and add on later) Expertise in software design and architecture. Strong problem solving and communication skills. Passion for emerging JavaScript and machine learning technologies. Experience with DevOps, like Azure/AWS/on-premise deployments and maintenance with Machine Learning/AI systems will be a plus. Experience in developing secure systems that fulfil stringent enterprise non-functional requirements will be a plus. Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C++"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [
            "JavaScript",
            "ReactJS",
            "VueJS"
        ],
        "techTypeFront": true,
        "jobDevopsTechs": [
            "MySQL",
            "AWS",
            "Azure",
            "Git"
        ],
        "techTypeDevops": true,
        "link": "https://sg.linkedin.com/jobs/view/software-engineer-at-keyreply-2193832641?refId=77035341-35b5-4dba-888d-4625274f4954&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Information Technology and Services"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer - Marketplace",
        "company": "Gojek",
        "place": "Bengaluru, Karnataka, India",
        "date": "2020-10-15",
        "description": "About The Role We are the Reliability team in the Mobility Marketplace group. Our prime objective is to make sure that any new feature in the Marketplace domain can be shipped for experimentation by business in a matter of days. We act as a central binding agent for Pricing, Supply and Matchmaking teams and make sure that the overall architecture and infra is flexible, designed for failure, easily extensible and scalable. As a Software Engineer, you'll work closely with product, operations, and engineering teams throughout the company. What you’ll do Pair with team members on functional and nonfunctional requirements and spread design philosophy, goals and improvements to code quality across the team Design and Develop new features or refactor applications to ensure high-quality design in existing systems Communicate, collaborate and work effectively across distributed teams in a global environment Improve observability of the systems to bring more confidence to the team Pair for on-call requests to address issues faced by end-users, carry-out preliminary diagnosis and work towards providing appropriate resolution What you’ll need Should have at least 2 years of experience with server side development Have experience in designing, developing, testing and deploying Have experience in applications on Golang/Java for large scale applications. Proficient in OOP, SQL, Design Patterns. Experience with functional programming is a plus Have data modelling experience in Relational or NoSQL databases Ability to implement Continuous Integration and Continuous Delivery Well-versed with Agile methodologies, TDD and Test Engineering and Automation Able to design and implement low latency RESTful/GRPC services Have experience troubleshooting server performance - memory issues, GC tuning, resource leaks etc About The Team The Marketplace Product Development Team at Gojek handles the hardest quantitative problems related to improving Gojek's real-time marketplace which deeply impact everyday experiences of our customers(riders) and drivers. The Mobility Marketplace team is responsible for making sure that its millions of customers are paired with the right drivers at optimum price at the right time. This supply and demand matching is the core problem that our Product Team tackles every day. The Marketplace team focuses on building technology to achieve market balance (matching the supply of drivers with demand from customers) and optimize the reliability and availability of Gojek's trip fulfillment. We are the brain of Gojek, tackling the company's most challenging quantitative problems: optimizing and providing real time positioning guidance to drivers; At Gojek, we ignite opportunity by setting the world in motion. We take on big problems to help drivers, riders(Customers) to have tension free rides. About Us Gojek is a Super App. It’s one app for ordering food, commuting, digital payments, shopping, hyper-local delivery, and dozen other products. It is Indonesia’s first and only decacorn. It's also the only Southeast Asian startup to be part of Fortune's list of 'Companies That Changed The World.' Our Mission: To create and scale positive socio-economic impact for our customers, driver-partners, business and MSMEs. As of 2018, Gojek processed more than $9 billion annualised gross transaction value across all markets where it operates - in Singapore, Thailand, Vietnam and Indonesia. We have the largest food delivery product in Asia, (outside of China), and the largest payments wallet in Southeast Asia. Our investors include Google, Facebook, PayPal, Sequoia Capital, Tencent Holdings among others. Gojek is committed to building a diverse and inclusive workplace and is an equal opportunity employer. We do not discriminate on the basis of race, religion, national origin, gender, gender identity, sexual orientation, disability, age, education status, or any other legally protected status. Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C++",
            "GoLang"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [
            "Git"
        ],
        "techTypeDevops": true,
        "link": "https://in.linkedin.com/jobs/view/software-engineer-marketplace-at-gojek-2217966153?refId=77035341-35b5-4dba-888d-4625274f4954&position=18&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Computer Software, Internet, Financial Services"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "JUST EAT",
        "place": "London, England, United Kingdom",
        "date": "2020-10-19",
        "description": "Key Responsibilities We don’t divide responsibility for development and operation of our platform, so you and your team will support the changes you make all the way through to operating successfully in production at peak times. Our product development teams are growing because we have a huge number of ideas on how to improve the experience customers and restaurants have. As an Engineer, you will need to play a key role in turning those ideas into reality. You’ll need to ● Track the progress that you are making towards the wider goals of your team, and transparently communicate that progress to your team and Technology Manager. ● Keep to the processes, standards and designs that your team has agreed. ● Ensure you and others continuously improve by proposing and then implementing new processes, designs and engineering practices that make your team more effective. ● Contribute to the definition of product features, including in workshops with other product development teams. ● Communicate the technical work of your team to other product development teams. ● Take responsibility for supporting your changes all the way through to proving that they work well – and continue to work well – in production. Your Profile & Experience ● C# ● .NetCore/latest version of .net framework ● Amazon Web Services or similar e.g Azure, Google Cloud ● JavaScrip ● HTML ● CSS & Responsive Web Design ● SQL Server, MySQL or PostgreSQL, DynamoDB ● Experience working in a Continuous Delivery cycle ● Working in Microservices Architecture Our Engineering Principles ● Design and build great software ● Move fast with confidence ● Secure, stable, scalable, fast and reliable platform ● Trust, control and transparency Why work at Just Eat Takeaway.com? Just Eat Takeaway.com is a le​ading global online food delivery marketplace headquartered in Amsterdam and listed on the London Stock Exchange. We've built our business on having the widest choice available on our platform – connecting millions of customers with over 155,000 restaurants across 24 countries - with over 100 different cuisines from local independents to globally famous restaurants, available to order via our app and website. We provide the platform and tools to help independent restaurants move online and reach a significantly broader customer base – to generate increased orders and grow their businesses. We also provide the insights, advice, and support our growing community needs to satisfy customers and help raise standards across a vibrant takeaway sector. We’re built to deliver behind the scenes too. To make Just Eat the great company it is, it takes a great team of people. Which is why all of our colleagues are welcomed into a diverse and inclusive workplace where they feel they can belong. We're passionate about nurturing our people and offer a full programme of training and support to our employees – helping them to develop their careers in a way that suits them. No matter who you are, what you look like, who you love, where you are from, religious beliefs or takeaway preferences you could find your place at Just Eat Takeaway.com. We’re a diverse and inclusive workplace that promotes a sense of belonging, allowing all of our people to bring their most colourful and complex selves to work every day. Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C#",
            "C++"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [
            "MySQL",
            "PostgreSQL",
            "Azure"
        ],
        "techTypeDevops": true,
        "link": "https://uk.linkedin.com/jobs/view/software-engineer-at-just-eat-2192262084?refId=77035341-35b5-4dba-888d-4625274f4954&position=19&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Mid-Senior level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Internet"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Dev Engineer III- Backend",
        "company": "Swiggy",
        "place": "Bengaluru, Karnataka, India",
        "date": "2020-10-16",
        "description": "About the team* New Initiatives at Swiggy works at the cutting edge of new trends and customer behavior. We work on high conviction, high impact projects that shape the future of Bundl Technologies. About the role* Building new products demands an unmistakable growth mindset, agility, and high-degree of comfort with uncertainty. Every member has to go above and beyond their official responsibilities to create results. You'll be expected to operate as if this were your company and you'll be ultimately responsible for the technological and the business outcomes. SDE III in Swiggy plays a key role in owning end to end design and architecture of a complex system they are assigned to. Responsibilities* You'll be building the product from scratch and you'll have to make decisions regarding tech stack, third-party services, and update strategies that keep the team nimble. Take complete ownership of the development cycle, from incoming feature requests to post-release feedback. You are responsible for quality assurance of your code, which means taking into account the expected user outcome, which may not be clearly communicated in the requirements doc. What do we look for? Technical hands-on, with deep dive expertise in designing and developing real-time internet applications or high scale SAAS applications. 5-8 years of experience in developing products Excellent command over Data Structures and Algorithms and strong problem solving and analytical skills. Exceptional coding skills in an object-oriented programming languages like (Java/ROR/Golang) Experience with high-performance websites catering to millions of daily traffic is a plus. Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C++",
            "GoLang"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [],
        "techTypeFront": false,
        "jobDevopsTechs": [],
        "techTypeDevops": false,
        "link": "https://in.linkedin.com/jobs/view/software-dev-engineer-iii-backend-at-swiggy-2187578811?refId=77035341-35b5-4dba-888d-4625274f4954&position=20&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Associate",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Information Technology and Services, Computer Software, Internet"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "Picovoice",
        "place": "Vancouver, British Columbia, Canada",
        "date": "2020-10-19",
        "description": "Fast-growing and venture-backed AI startup seeks an exceptionally talented engineering leader to help shape the future of voice AI. The ability to learn new technologies and solve highly-vague problems on a tight schedule is critical. Top-notch communication skills are essential. Expect to work with motivated, intense, and smart peers. Your compensation will include meaningful equity. Required Skills: Experience building complex and extensible software Proficiency in at least one object-oriented programming language Practical understanding of data structures and algorithms Preferred Skills: Proficiency with modern frontend frameworks Experience with cloud services Working understanding of databases Ability to code in multiple languages (Python, Java, Swift, JavaScript, C#, C) Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C#",
            "Swift",
            "C++",
            "Python"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [
            "JavaScript"
        ],
        "techTypeFront": true,
        "jobDevopsTechs": [],
        "techTypeDevops": false,
        "link": "https://ca.linkedin.com/jobs/view/software-engineer-at-picovoice-2193845840?refId=77035341-35b5-4dba-888d-4625274f4954&position=21&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Computer Software"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "Instacart",
        "place": "Toronto, Ontario, Canada",
        "date": "2020-10-17",
        "description": "Overview We're looking for Software Engineers with experience building scalable applications and systems to join our fast moving team in Toronto. Software Engineers at Instacart work on a wide range of interesting and challenging problems at scale, from supporting thousands of concurrent shoppers and processing millions of data points in real-time, to building tools for ad campaigns and sign-ups. At Instacart, you will work on features that define our industry in an open and collaborative environment serving millions of requests daily! We love Software Engineers who are capable of building a solution and owning problems end-to-end. There is a tremendous amount of opportunity in front of us, and joining our team at Instacart gives you a chance to grow your career and interests, as we succeed together! About The Job You will be part of a team with a large amount of ownership, responsibility and autonomy You will work closely with Senior Engineers, Product Managers, other teams, and internal/external stakeholders, owning a large part of the process from understanding a problem to shipping the solution You will ship high quality, scalable and robust solutions with a sense of urgency You will have the freedom to suggest and drive organization-wide initiatives Instacart's technology is constantly changing and adapting. Some of the technologies you will use at Instacart include: React Ruby Python Postgres Snowflake Cypress And many others yet to come If you have experience with these technologies, you will have the opportunity to dive deeper. If you haven't used some of these technologies, you’ll have the chance to learn from the collective experience of our team. About You Bachelor’s degree in Computer Science, Computer Engineering, Electrical Engineering or equivalent 1+ years of working experience as a Software Engineer Self-motivated & enjoy working in a fast paced environment Possess a strong sense of ownership Thrive in a collaborative team environment Excited by a strong career growth opportunity Excited to adopt new technologies & skills Show moreShow less",
        "jobBackTechs": [
            "C++",
            "Python"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [
            "ReactJS"
        ],
        "techTypeFront": true,
        "jobDevopsTechs": [
            "Ruby"
        ],
        "techTypeDevops": true,
        "link": "https://ca.linkedin.com/jobs/view/software-engineer-at-instacart-2190068779?refId=77035341-35b5-4dba-888d-4625274f4954&position=22&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Marketing and Advertising, Computer Software, Internet"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "Chick-fil-A Corporate",
        "place": "Atlanta, GA",
        "date": "2020-10-17",
        "description": "The Chick-fil-A Software Engineering role will give you the opportunity to grow in a fast-paced dynamic environment solving high-impact problems using code. In this particular role, you’ll serve on a team that develops and operates two vital financial products for Chick-fil-A that are utilized by other staff members to operate our business model. In the role, you’ll rotate through various aspects of the products cultivating skills in a team-oriented environment. Responsibilities Design and develop software solutions Develop a high proficiency in infrastructure and deployment services like AWS and Kubernetes Develop a high proficiency in programming languages like Java, JavaScript (Angular/React), Python, and Go Grow into a subject matter expert in areas like application security, data analytics, machine learning, and site reliability engineering Minimum Qualifications Programming experience in Java, JavaScript, Python, Go, or other comparable language Experience with SQL Understanding of SDLC Understanding of application security Good interpersonal and team collaboration skills Preferred Qualifications Bachelor's degree, preferably in computer science or another applicable technical field Experience with Unix/Linux Experience with source control systems like Git or Subversion Minimum Years Of Experience 0 Travel Requirements 10% Preferred Level Of Education Bachelors Degree Major/Concentration Computer Science / Computer Engineering Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C++",
            "Python"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [
            "JavaScript",
            "AngularJS",
            "ReactJS"
        ],
        "techTypeFront": true,
        "jobDevopsTechs": [
            "AWS",
            "Git",
            "Linux"
        ],
        "techTypeDevops": true,
        "link": "https://www.linkedin.com/jobs/view/software-engineer-at-chick-fil-a-corporate-2188761184?refId=77035341-35b5-4dba-888d-4625274f4954&position=23&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Not Applicable",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Consumer Goods, Hospitality, Restaurants"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "Toast, Inc.",
        "place": "Boston, MA",
        "date": "2020-10-20",
        "description": "Now, more than ever, the Toast team is committed to our customers. We’re taking steps to help restaurants navigate these unprecedented times with technology, resources, and community. Our focus is on building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love. And because our technology is purpose-built for restaurants, by restaurant people, restaurants can trust that we’ll deliver on their needs for today while investing in experiences that will power their restaurant of the future. Toast is looking for motivated individuals who want to build great software and work with and learn from talented peers while doing it. We work extensively with Android and web front ends, where we work hard to provide a well-designed user interface for our customers. Our infrastructure runs in Amazon Web Services where we run Java and Kotlin microservices in Docker containers; our customers rely on us to keep this infrastructure fast and stable so that their point-of-sale system \"just works\", despite being a complex distributed system. We need talented engineers to build and maintain the highest quality product and infrastructure as our vision moves forward. About this roll* (Responsibilities) Members Of The Team Will Have Responsibilities Such As This is an entry-level role where you will work on a small team with 3-6 engineers, QA, product manager, and UX designer. Teams are typically responsible for a significant module out of Toast’s product suite. Build and maintain high performance, flexible, and highly scalable web and mobile applications Participate in designing, estimating effort, implementing, testing, debugging, configuring, integrating and documenting database, middle-tier and front-end code Diagnose performance bottlenecks and implement optimizations Think in terms of the end-user and design accordingly Actively contribute to product design and feature selection discussions Participate in code reviews to ensure technical implementations meet functional requirements Do you have the right ingredients*? (Requirements) As we have openings in multiple teams, the specific skills required to be successful will vary, but if you have any of these skills, please apply! Growth mindset and openness to learning new skills Experience with or openness to using Java, Kotlin, Python, JavaScript (ES6) for software development. A small number of roles may benefit from experience in C#. Interest in general software engineering OR specialties such as front-end, back-end and infrastructure, Android or developer productivity/tooling. Able to communicate clearly in verbal and written communication, particularly with remote employees Our Interview Process For These Roles Will Consist Of Code screen via automated tool 30m call with a recruiter 60m technical interview with one or two of our software engineers 30m cultural add interview with a member of our R&D team We welcome your questions about Toast at any point during the interview process! Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C#",
            "C++",
            "Kotlin",
            "Python"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [
            "JavaScript"
        ],
        "techTypeFront": true,
        "jobDevopsTechs": [
            "Docker"
        ],
        "techTypeDevops": true,
        "link": "https://www.linkedin.com/jobs/view/software-engineer-at-toast-inc-2219129404?refId=77035341-35b5-4dba-888d-4625274f4954&position=24&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Entry level",
        "jobFunction": "Quality Assurance, Engineering",
        "employmenttype": "Full-time",
        "industries": "Computer Software, Internet, Information Technology and Services"
    },
    {
        "query": "Software Engineer",
        "location": "Anywhere",
        "title": "Software Engineer",
        "company": "Apple",
        "place": "Cupertino, CA",
        "date": "2020-10-15",
        "description": "Summary Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Do you love building highly scalable, distributed web applications? Do you get excited about performance tuning a Web Application environment and applications its limits? Do you enjoy working with other high output engineers? Are you experienced in creating solutions from gathering requirements all the way through user testing and deployment to production? If so, then join our team and make a difference by delivering projects providing metrics and data for business partners making mission critical decisions. Key Qualifications Experience in a professional development environment Strong PHP, Javascript, HTML, CSS, etc. experience Strong ability in Object Oriented Programming and Design Solid foundation in Computer Science fundamentals such as data structures and algorithms Knowledge and ability to understand enterprise level architecture. Demonstrated experience working with high-volume, multi-tiered, distributed critical applications. Understanding of MVC and modern web frameworks. Ability to develop new and innovative applications as well as maintaining existing code. Ability to organize & communicate effectively, both written and verbal, with technical and non-technical people across functional teams. Strong relationship building skills are required. A desire to work in a fast-paced and challenging work environment. Experience in Agile methodologies and SCRUM is a plus. Full-stack experience. Frontend using Javascript and CSS along with frameworks (ReactJs, Angular, etc) as well as backend using different stacks (PHP Symfony, NodeJs Express, etc). Description We are looking for a self starting, energetic, mature individual with very strong and senior software engineering capabilities. You should have experience delivering advanced solutions for a multi-tier, distributed web application. As part of this team your responsibilities include working closely with and leading other engineering team members, and interacting with product, design, content, business and many other groups to deliver world-class software solutions. Our team is not afraid to question assumptions and posses superb communication skills. Education & Experience Bachelors degree in Computer Science, Mathematics, or relevant and equivalent industry experience required. Additional Requirements Should be able to provide sample work as requested. Show moreShow less",
        "jobBackTechs": [
            "Java",
            "C++",
            "PHP"
        ],
        "techTypeBack": true,
        "jobFrontTechs": [
            "JavaScript",
            "AngularJS",
            "ReactJS"
        ],
        "techTypeFront": true,
        "jobDevopsTechs": [
            "Express"
        ],
        "techTypeDevops": true,
        "link": "https://www.linkedin.com/jobs/view/software-engineer-at-apple-2185714623?refId=77035341-35b5-4dba-888d-4625274f4954&position=25&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
        "senorityLevel": "Not Applicable",
        "jobFunction": "Engineering, Information Technology",
        "employmenttype": "Full-time",
        "industries": "Consumer Electronics"
    }
]