[{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer I","company":"Grubhub","place":"Chicago, IL","date":"2020-10-26","description":"Software Engineer I Job Locations US-IL-Chicago Job ID 2020-10295 Category University About The Opportunity About The Opportunity Grubhub is dedicated to connecting hungry diners with our wide network of restaurants across the country. Our innovative technology, easy-to-use platforms and streamlined delivery capabilities make us an industry leader today, and in the future of online food ordering. We strive to create a workplace that reflects the diversity of our customers and the communities we serve. When you join our team, you become part of a community that works together to innovate, solve problems, take risks, grow, work hard and have a ton of fun in the process! Why Work For Us We have a fast-paced environment and that is what our teams thrive on. Grubhub believes in empowering people and offering opportunities for development, as well as professional growth. We value strong, positive relationships in all areas: with each other, our customers and our greater community. Want to be a part of a team of diverse collaborators in an authentically fun culture? If so, we want to talk to you - and hear what’s your favorite restaurant for food delivery! The Impact You Will Make Design, implement, and deliver awesome technical platforms and products for all constituencies (diners, corporate accounts, restaurants, internal tools) Understand our products from both a technical and business perspective in the context of our larger business. Communicate with leadership, product owners, other technologists, and users to create working software based on an understanding of business and technical priorities. Break down complex problems into elegant technical solutions to intelligently solve problems for diners, restaurant, corporate accounts and internal stakeholders. Actively contribute to the adoption of strong software architecture, development best practices, and new technologies. We are always improving the process of building software; we need you to help contribute. You will be a key part in accurately estimating the timing of software delivery. What You Bring To The Table Bachelor’s Degree in Computer Science, Software Engineering or related field Strong track record of strong academic performance (3.0 or higher cumulative GPA) Solid foundation in software programming in one or more of the following languages: Java, Python, C, C++, Ruby, Scala, C#, Objective C Eagerness to contribute in a team-oriented environment Ability to work creatively and analytically in a problem-solving environment Familiar with Agile software development methodologies Interested in working for a fast paced tech and product oriented company And Of Course, Perks! Flexible PTO. Grubhub employees are provided a generous amount of time to recharge their batteries. Health and Wellness. We provide programs that support your overall well-being such as generous medical benefits, employee network groups, company-wide fitness challenges, and a comfortable and casual workplace! We also support our parents by offering 8 weeks of paid parent bonding time, a 4-week returnship program, and 6-8 weeks paid medical leave. Learning and Career Growth. Your personal and professional development is a priority at Grubhub. From day one, we empower you to lead and be an active participant in your career growth. We provide continuous learning opportunities, training, and coaching and mentorship programs. MealPerks. Who’s ready for some lunch? We provide our employees with a weekly Grubhub credit to enjoy and support local restaurants. We also offer company-wide meals several times a year to bring our Grubhub family together. Fun. Every Grubhub office has an employee-led Culture Crew that connects people through fun, meaningful events and initiatives. Some of our popular past events include: Wing-eating contests, Grubtoberfest, 5k Runs, Bring Your Child to Work Day, regular happy hours, and more! Social Impact. We believe in the importance of serving the communities that support our business. In addition, employees are given paid time off each year to support the causes that are important to them. Grubhub is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. The EEO is the Law poster is available here: DOL Poster . If you are applying for a job in the U.S. and need a reasonable accommodation for any part of the employment process, please send an e-mail to TalentAcquisition@grubhub.com and let us know the nature of your request and contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this email address. CA Privacy Notice: If you are a resident of the State of California and would like a copy of our CA privacy notice, please email privacy@grubhub.com. Connect With Us! Not ready to apply? Connect with us for general consideration. Show moreShow less","jobBackTechs":["Java","C#","C++","Python"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":["Ruby"],"techTypeDevops":true,"link":"https://www.linkedin.com/jobs/view/software-engineer-i-at-grubhub-2213598695?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Marketing and Advertising, Computer Software, Internet"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Cabify","place":"Madrid, Community of Madrid, Spain","date":"2020-09-28","description":"Do you want to help us to change the world? At Cabify and Movo, We aim to make cities better places to live by improving mobility for the people living in them, connecting riders to drivers, providing mobility alternatives such as kick-scooter and mopeds and many others to come, at the touch of a button. Maybe one day cities will be places where nobody needs a private car. But we've still got a long way to go...fancy joining us? Our Product & Engineering teams include an eclectic bunch of awesome and diverse people from different backgrounds who come together as collaborative and inclusive teams to push boundaries. Right now, we have more than 20 million users around the world. We work across 11 countries and 90 cities, adapting our product fast to be leaders in all of those markets and taking care about sustainability. We're working on some pretty greenfield projects with a solid set of product ideas lined up. We are looking for committed and proactive people who want to keep learning constantly and also, help us to grow technically and humanly working in collaboration with awesome people, and making an impact across our teams. Having a diverse and inclusive work environment is really important for us. That's why we like to count with different points of view in our team that help us to solve problems in a better way. We are looking for engineers with experience working with any backend technology, though we use Go, Elixir and Ruby for our day to day work. We believe that even if you have worked in other programming languages such as Java all your life you can still pick up Elixir or Go pretty quickly. For us, it is more important to have someone who is adaptable and can pick up languages quickly. You will: Work on cross-team, impactful projects. Lead parts of these projects helping your team to deliver in a fast, reliable and high-quality way. Work on building and maintaining distributed applications. Improve reliability, scalability and performance of our services so they always meet their SLAs. Develop new features, tweak existing ones in a data-driven fashion in collaboration with our Data Science team. Produce simple, maintainable code while always looking to improve on it. Own your code all the way to production with a self-service continuous delivery pipeline and production infrastructure. Run what you build using bleeding edge container orchestration and monitoring technologies. Our Ideal candidate has: Great alignment with our values, we take this very seriously. Sound knowledge of common algorithms & data structures. Experience in developing medium/large-scale web applications and distributed systems in a production environment. Experience with common design and architectural patterns. Ability to work independently, but being a good team player too. Ability to understand and help to make great product and business decisions. Ability to achieve results in a fast-paced, changing environment. A willingness to work with Ruby code occasionally is a plus! Experience slaying monoliths is a plus! What's it like to work at Cabify? We're a company full of happy, motivated people and we never want that to change. Here are some more reasons why it rocks to be part of our family. Excellent Salary conditions at Engineering: Junior 24k-30k, Mid 30k-48k. We also offer a very competitive stock options plan. At Cabify we strongly believe highly committed, vision-aligned key roles must be long term investment in the company success, thus a significant portion of the compensation of roles such as this one goes in the form of stock options. We offer a relocation package to people who are coming from another country. Our office is located in Madrid, but a fully remote position is also available for this role. Two Remote days available per week if you are working in our Madrid office. Flexible work environment & hours Regular team events Cabify staff discount Personal development programs based on our career paths Training programs Flexible compensation plan: Subsidized restaurant tickets, transport tickets, healthcare and childcare A pet room so you don't have to leave your furry friend at home And last but not least...free coffee and fruit! Aren't you sure about if you fulfill all of the requirements? Even, if this position stands out your curiosity, please apply for it. At Cabify we believe that professional development happens through teaching and learning from your peers and managers. Cabify is proud of being an equal opportunity workplace. We celebrate diversity and we are committed to creating an inclusive environment for all employees regardless of background, gender, religion, orientation, age or ability. Join us! Show moreShow less","jobBackTechs":["Java","C++","Python"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":["Ruby"],"techTypeDevops":true,"link":"https://es.linkedin.com/jobs/view/software-engineer-at-cabify-2233119137?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Marketing and Advertising, Internet, Human Resources"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Tesla","place":"Fremont, CA","date":"2020-09-29","description":"THE ROLE As a Software Engineer you’ll take part in the design and development of software for the current and next generation of Tesla’s Enterprise Resource Planning systems. In this role, you’ll be developing highly complex applications with a team goal of streamlining business operations and improving overall user experience. The ideal candidate is a self-starter with a strong desire to increase efficiencies, and make an impact while contributing to a cross-functional team. Your ability to creatively collaborate and execute team goals will affect scalabiliy and directly contribute to the company mission of accelerating the world’s transition to sustainable energy. Responsibilities Work with experienced engineers across many functional areas to deliver business value to internal and external stakeholders. Design and develop new modules on the home grown ERP application Warp which is used to plan, procure and produce cars. Develop scalable solutions using tools like Angular, C# .net, MySQL and other open stack frameworks. Know your app! Seek to understand all aspects, business and technical, of the applications on which you work so that you can be most effective. Contribute towards the timely completion of development tasks and small projects while applying company standards. Continually learn and apply relevant software development practices, patterns, tools and technologies. Increase efficiency, reduce waste wherever and whenever possible. Requirements 4+ years in web application development, including: Implementing Application Programming Interfaces (APIs), Object Oriented Programming and Design (OOP&D), Object Relational Mapping (ORM) Experience in frontend development, using tools such as: JavaScript, Angular, React, etc. Experience in backend development, using tools such as: C#, Java, Go, Ruby, etc. Relational databases, SQL, NoSQL Agile Development Distributed Source Control, using tools such as: Git Education: BS/MS in Computer Science or equivalent degree. Employee Benefits As a full time Tesla employee you will receive full benefits from day 1 for you and your dependents. Kaiser and UnitedHealthcare PPO and HSA plans (including infertility coverage) 3 medical plan choices with $0 paycheck contribution Vision & dental plans (including orthodontic coverage) Company paid Life, AD&D, short-term and long-term disability 401(k), Employee Stock Purchase Plans, and other financial benefits Employee Assistance Program, Paid Time Off, and Paid Holidays Back-up childcare and employee discounts Show moreShow less","jobBackTechs":["Java","C#","C++"],"techTypeBack":true,"jobFrontTechs":["JavaScript","AngularJS","ReactJS"],"techTypeFront":true,"jobDevopsTechs":["Ruby","MySQL","Git"],"techTypeDevops":true,"link":"https://www.linkedin.com/jobs/view/software-engineer-at-tesla-2210795862?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Automotive, Renewables & Environment, Utilities"},{"query":"Software Engineer","location":"Anywhere","title":"Software Development Engineer I","company":"Mastercard","place":"Vancouver, British Columbia, Canada","date":"2020-09-29","description":"Our Purpose We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results. Job Title Software Development Engineer I Overview Who is Mastercard? We are the global technology company behind the world’s fastest payments processing network. We are a vehicle for commerce, a connection to financial systems for the previously excluded, a technology innovation lab, and the home of Priceless®. We ensure every employee has opportunity to be a part of something bigger and to change lives. We believe as our company grows, so should you. We believe in connecting everyone to endless, priceless possibilities. Mastercard Launch is a full-time graduate development program designed to build the skills we leverage most as an innovator in the payments space, connects employees in enriching ways, and immerses new talent into our Doing Well by Doing Good culture. This program is meant for those who dare to be greater and those who wish to make a real impact in the world. Eligibility requires degree completion of a bachelors or masters degree in December of 2020 or May 2021. Mastercard’s software engineering teams leverage Agile development principles, advanced development and design practices, and an obsession over security, reliability, and performance to deliver solutions that delight our customers. As a software development engineer, you’ll develop advanced technologies and applications that are revolutionizing payments. Are you passionate about software engineering? Do you enjoy seeing the impact your code has on a wide range of customers? Do you want to work for a company that offers above and beyond benefits including paid parental leave, flexible work hours, gift matching, and even volunteer incentives while encouraging your own professional learning and development? Do you thrive in a place where you are continuously learning more while growing your skills and career? Do you want to join a Company that offers a competitive benefits-and rewards program that attracts, develops and retains the most talented employees around the world? Do you want to join an inclusive culture where employees, in all their diversity, feel valued, respected and who can bring their authentic selves to work? Learn more at Mastercard’s Corporate Sustainability Report. Role Hands-on developer who writes high quality, secure code for a small to mid-sized component or feature that is modular, functional and testable. Contribute to all parts of the software’s development including design, development, documentation, and testing. Have strong ownership of your team’s software and are deep in the maintenance characteristics, runtime properties and dependencies including hardware, operating system, and build. Communicate, collaborate and work effectively in a global environment. All About You Currently enrolled in a bachelor’s or master’s degree program majoring in Computer Science or a related field with a graduation date of December 2020 or May 2021. Strong foundation in algorithms, data structures and core computer science concepts. Evidence of working with object-oriented development and design patterns. Proficiency in one or more modern programming languages such as Java, Python, C++ Strong written and verbal English communications skills. Strong analytical and excellent problem-solving skills. Experience working in an Agile environment. Due to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together. Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact reasonable.accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly. Show moreShow less","jobBackTechs":["Java","C++","Python"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":["Git"],"techTypeDevops":true,"link":"https://ca.linkedin.com/jobs/view/software-development-engineer-i-at-mastercard-2206974058?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Financial Services, Information Technology and Services, Internet"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Bose Corporation","place":"Stow, MA","date":"2020-10-26","description":"Job Description Are you dreaming for an opportunity to experience professional software development environment, to learn the software development tricks and secrets from nice senior developers, or to put your skills in Android mobile app development to a real project and see it being applauded? If yes, come to join us, a small team full of energy and innovation. Here you will be involved in software development for automotive audio systems, exposed to all the aspects of a product - hardware board, embedded software, OS, web apps, GUI, mobile apps, etc. It will be great if you have previous experience in Android mobile app and/or python/java development. Your development will contribute to a new exploratory project of our team, which could potential open up new market for our ADS audio products. Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/EO13665_PrescribedNondiscriminationPostingLanguage_JRFQA508c.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information. Show moreShow less","jobBackTechs":["Java","C++","Python"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":[],"techTypeDevops":false,"link":"https://www.linkedin.com/jobs/view/software-engineer-at-bose-corporation-2240211332?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Consumer Electronics, Automotive"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer - Backend","company":"FARFETCH","place":"Porto, Porto, Portugal","date":"2020-09-28","description":"Farfetch exists for the love of fashion. We believe in empowering individuality. Our mission is to be the global platform for luxury fashion, connecting creators, curators and consumers. We’re a diverse and global community made up of Farfetchers, our partners and our customers, which we believe is at the heart of our success. Everything we do is centred around our values - Be Human, Think Global, Be Revolutionary, Todos Juntos, Be Brilliant, Amaze Customers - which define our beliefs and our actions. We welcome difference and foster a consciously inclusive environment for everyone. We are Farfetch For All. Technology We’re on a mission to build the technology that powers the global platform for luxury fashion. We operate a modular end-to-end technology platform purpose-built to connect the luxury fashion ecosystem worldwide, addressing complex challenges and enjoying it. We’re empowered to break traditions and disrupt, with the freedom and autonomy to make a real impact for our customers all over the world. Porto Our Porto office is located in Portugal's vibrant second city, known for its history and its creative yet cosy environment. We welcome new ideas and a large number of our people. From Account Management to Technology and Product, whatever your skills are, you'll find your fit here. You can have an informal meeting in the treehouse or play the piano in your lunch break! The role We are looking for a Software Engineer who is motivated to build world-class applications using top notch technology. You will be working in a very friendly and relaxed environment and be part of a well-motivated, talented and growing team. If you love to learn, if you are willing to share knowledge and would love to be part of the building process to reach the top, using the latest technology stack and having fun doing it, this is an opportunity you can’t miss. What you'll do Contribute to the development of our E-Commerce Platform and the evolution of our Marketplace; Stay up to speed with all backend and web technologies, software architecture principles and design patterns; Apply your knowledge on performance and security measures; Being able to work in an Agile environment, focusing on delivery/commitment and software continuous improvement; Work with the following technologies: Apache Cassandra, Neo4j, Redis, MongoDB, Asp.net Core, Kafka, RabbitMQ, ActiveMQ, Identity Server, OpenID Connect. Who you are An experienced object oriented languages programmer Knowledgeable of unit tests and/or integration tests Knowledgeable of SQL language and experience using relational databases with preference for SQL Server Knowledgeable of REST APIs Experienced in NoSQL databases and SOA architecture is a plus A professional with experience working with SCRUM methodologies is also a plus Proficient in written and spoken English Motivated to build world-class applications using top notch technology. Show moreShow less","jobBackTechs":["C++"],"techTypeBack":true,"jobFrontTechs":["ASP.NET"],"techTypeFront":true,"jobDevopsTechs":["MongoDB","Apache"],"techTypeDevops":true,"link":"https://pt.linkedin.com/jobs/view/software-engineer-backend-at-farfetch-2230170038?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Information Technology and Services, Computer Software, Internet"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer, Backend","company":"Grab","place":"Bengaluru, Karnataka, India","date":"2020-10-23","description":"Job Description: Get to know our Team: The payments back end team is responsible for building safe, secure and high throughput payments primitives. We own a range of platform primitive components such as, but not limited to, Wallet, Fraud Prevention System and API Gateway. We take pride in building distributed systems that have the real impact on the lives of millions of users in our endeavor to out-serve the underserved population. Terms such as Idempotency, CAP theorem, Distributed Consensus are not just theoretical terms for us but have a real bearing on the systems we build. Get to know the Role: Design, develop, and maintain backend components and services. Be proactive and creative to strike the right balance between product, engineering, and business needs. Relentless focus on delivering high quality, bug-free code. Help and mentor those around you to achieve the team and company goals. Go the extra mile to identify and fix customer pain-points. The day-to-day activities: Collaborate with the product, business, and program management team to be on top of your deliverables. Participate in technical and product review meetings. Timely delivery of high quality, maintainable and operationally excellent code. Timely closure of all the assigned code review and design reviews. Closely work with SRE and DevOps team to setup hardware and microservices infrastructure. Participate in team on-call rotation to help us achieve operational excellence. The must haves: Engineering graduation. Specialization in CS/IT is desired but not required. Working knowledge of building back end systems around DBMS, Caches, NoSQL, Web and App servers. Proficient in at least one programming language. Proficient in fundamentals of CS such as Data Structures, Algorithms, Operating Systems etc., Looking for folks with at least 2 years of experience. You grok Web technologies and distributed systems. Experience in building consumer facing product is highly desired but not required. Prior experience in building OLTP systems is highly desired but not required. Curiosity to learn new concepts. Show moreShow less","jobBackTechs":["C++"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":[],"techTypeDevops":false,"link":"https://in.linkedin.com/jobs/view/software-engineer-backend-at-grab-2207192416?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Information Technology, Product Management, Engineering","employmenttype":"Full-time","industries":"Computer Software, Internet, Financial Services"},{"query":"Software Engineer","location":"Anywhere","title":"Software Dev Engineer III- Backend","company":"Swiggy","place":"Bengaluru, Karnataka, India","date":"2020-10-23","description":"About the team* New Initiatives at Swiggy works at the cutting edge of new trends and customer behavior. We work on high conviction, high impact projects that shape the future of Bundl Technologies. About the role* Building new products demands an unmistakable growth mindset, agility, and high-degree of comfort with uncertainty. Every member has to go above and beyond their official responsibilities to create results. You'll be expected to operate as if this were your company and you'll be ultimately responsible for the technological and the business outcomes. SDE III in Swiggy plays a key role in owning end to end design and architecture of a complex system they are assigned to. Responsibilities* You'll be building the product from scratch and you'll have to make decisions regarding tech stack, third-party services, and update strategies that keep the team nimble. Take complete ownership of the development cycle, from incoming feature requests to post-release feedback. You are responsible for quality assurance of your code, which means taking into account the expected user outcome, which may not be clearly communicated in the requirements doc. What do we look for? Technical hands-on, with deep dive expertise in designing and developing real-time internet applications or high scale SAAS applications. 5-8 years of experience in developing products Excellent command over Data Structures and Algorithms and strong problem solving and analytical skills. Exceptional coding skills in an object-oriented programming languages like (Java/ROR/Golang) Experience with high-performance websites catering to millions of daily traffic is a plus. Show moreShow less","jobBackTechs":["Java","C++","GoLang"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":[],"techTypeDevops":false,"link":"https://in.linkedin.com/jobs/view/software-dev-engineer-iii-backend-at-swiggy-2208456712?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Associate","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Information Technology and Services, Computer Software, Internet"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Siemens Technology India","place":"Bengaluru, Karnataka, India","date":"2020-10-23","description":"Software Developer (Babylon JS) Electrical Energy keeps the world moving. No matter where the power comes from or where it needs to go we make sure it makes its way. Can you help us shape the future? We’re looking for dedicated people with the skills and vision to build a better tomorrow. Join our Smart Grids and Infrastructure team as a Power System Engineer and help us create the technology that will transform entire industries, cities and even countries. Welcome to our world! Join us now. What Part Will You Play We need a Software developer to design software solutions based on requirements and within the constraints of architectural /design guidelines. You will derive software requirements and software functional specification, validate software requirements, provide software feasibility analysis and software effort estimation. Accurate translation of software architecture into design and code. Guide Scrum team members on all design topics & implementation consistency against the design/architecture You will be involved in coding of features and/or bug-fixing and delivering solutions adhering to coding and quality guidelines, for self-owned components Guide the team in test automation design and also towards implementation of the same. We don’t need superheroes, just super minds! You should have 2 to 6 years of experience on Babylon JS or other similar WebGL libraries with experience in Designing, building and maintaining efficient, reusable, and reliable code Proficient at collaborating with UI / UX designers and implementing UI systems. Should have experience with 3D and working knowledge of WebGL or OpenGL, and the math associated with the same You must have knowledge of JavaScript or typescript Use the Babylon JS platform to develop & maintain the 3D engineering application You need to have deep understanding and hands on experience on handling NFRs Experience working with Git /Bit-bucket and Full stack development We’ve got quite a lot to offer. How about you? This role is based in Bangalore. You’ll also get to visit other locations in India and beyond, so you’ll need to go where this journey takes you. In return, you’ll get the chance to work with teams impacting entire cities, countries – and the shape of things to come. We’re Siemens. A collection of over 379,000 minds building the future, one day at a time in over 200 countries. We're dedicated to equality and we welcome applications that reflect the diversity of the communities we work in. All employment decisions at Siemens are based on qualifications, merit and business need. Bring your curiosity and creativity and help us craft tomorrow. Find out more about Siemens careers at: www.siemens.com/careers Organization: ADVANTA Company: Siemens Technology and Services Private Limited Experience Level: Experienced Professional Job Type: Full-time Show moreShow less","jobBackTechs":["Java","C++"],"techTypeBack":true,"jobFrontTechs":["JavaScript"],"techTypeFront":true,"jobDevopsTechs":["Git"],"techTypeDevops":true,"link":"https://in.linkedin.com/jobs/view/software-engineer-at-siemens-technology-india-2207182689?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Research","employmenttype":"Full-time","industries":"Electrical/Electronic Manufacturing"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Instasolv","place":"Delhi, Delhi, India","date":"2020-10-13","description":"What Makes You A Great Fit We are looking for someone who is skilled in Architecture, Design and Development of Node.js backed systems Skilled in performance and scalability optimizations. Experienced in MongoDB database design and cluster architecture. What You'll Do Implement CI/CD pipeline for client, server and middleware applications Brainstorm and prepare logical and physical solution architecture diagrams Work on software/server installation, configuration from Dev to Prod environments Prepare project documents and deployment play-book/run-book for maintenance and migration Show moreShow less","jobBackTechs":["C++"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":["MongoDB"],"techTypeDevops":true,"link":"https://in.linkedin.com/jobs/view/software-engineer-at-instasolv-2240244758?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Information Technology and Services, Computer Software, Internet"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer I","company":"Ellevest","place":"Remote, OR","date":"2020-10-21","description":"About This Position As a Software Engineer I at Ellevest, you will work to design, build, and support many of the core systems powering Ellevest’s software and user experience. From our marketing site, to our web and mobile apps, to our financial computation engine, our Engineering team is at the heart of our organization, ensuring a best-in-class experience for our clients. We follow agile methodologies and on a day-to-day basis, leverage Ruby on Rails, React, and React Navitve, among others. Our systems run on a modern AWS stack supported by exciting new technologies, and our entire team works in a highly collaborative, flexible structure to build towards high impact client facing outcomes. This is a remote position, and you will be working under the direction of one of our Technical Leads within the Engineering organization. You Will Responsibilities Code in a collaborative, agile environment developing new features across the stack Write well-tested, clean code and review other team members’ contributions Collaborate closely with product managers, product designers, software engineers, and QA engineers to develop new product features and implement product enhancements Partner with senior team members to maintain and improve Ellevest’s infrastructure, workflows, and systems Investigate and fix bugs throughout the codebase You Have Requirements Good command of object-oriented programming best practices Ruby & React experience (preferred) Completed a coding bootcamp, self taught coding skills, or completed an undergraduate degree in computer science or a related area of study Experience supporting and scaling consumer-facing web applications and familiarity working with third party APIs Interest in working in a fast-paced, dynamic, and cross-functional work environment. This includes working independently and on a team. Passion for our mission to get more money in the hands of more women+ About Ellevest Ellevest was built with a mission to get more money in the hands of women+. With a money membership that gives access to investing, banking, learning, and coaching and a private wealth management service, Ellevest helps women+ take control of their financial futures. Ellevest was co-founded by Wall Street veteran Sallie Krawcheck. Sallie is chair of the Ellevate Network and author of “Own It: The Power of Women at Work.” She previously worked as CEO of Smith Barney and Merrill Lynch Wealth Management and as CFO of Citi. Ellevest has raised $70MM from investors including Rethink Impact, Pivotal Ventures, Valerie Jarrett, Salesforce Ventures, PayPal Ventures, MasterCard, Khosla Ventures, Morningstar, and Venus Williams. Show moreShow less","jobBackTechs":["C++"],"techTypeBack":true,"jobFrontTechs":["ReactJS"],"techTypeFront":true,"jobDevopsTechs":["Ruby","Ruby on Rails","AWS"],"techTypeDevops":true,"link":"https://www.linkedin.com/jobs/view/software-engineer-i-at-ellevest-2240651321?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Marketing and Advertising, Financial Services, Investment Management"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Dialpad","place":"Vancouver, British Columbia, Canada","date":"2020-09-28","description":"Dialpad is the most modern business communications company in the industry. Our products range from conferencing calling, to phone systems to contact center solutions that are all built with the end-user in mind. We allow workers to be productive from anywhere on any device and have moved all the power of an on-premise phone system or contact center to the cloud to be accessed and used by modern workers in today's Work from Anywhere environment. Who We Are At Dialpad, work isn't a place you go, it's a thing you do. We not only build products to enable the everywhere worker, but we also are everywhere workers. With offices in San Francisco, San Ramon, Austin, Raleigh, Vancouver, Waterloo, Tokyo, London and Bangalore, we truly believe in finding the best talent everywhere. We also embrace the Work from Home movement and are just as happy hiring great talent from anywhere if they choose to work from home rather than in an office. With $120 million in funding from ICONIQ Capital, Google Ventures, Andreessen Horowitz, Scale Ventures and other top VC's Dialpad attracts top engineers from companies like Microsoft and Google, and every member of our team plays an essential role in creating dynamic products that enable workers to be productive from anywhere. About The Role We are looking for engineers to work efficiently as part of our professional software engineering team; learning to own and support features past delivery and through their full life-cycle. As an Engineer at Dialpad, you will work with a close-knit product engineering team and technical lead. Our teams are cross disciplinary, and include Product Managers, Designers, QA, and other Engineers (Data Engineering, Data Science, Telephony). You will participate in design meetings and ask clarifying questions to fully understand customer scenarios and requirements. You will work with consumer/dependency owners for design review and sign-off, be a technical leader within your software feature, mentor and share knowledge with the rest of the engineering team. Responsibilities Develop easy-to-use, scalable, robust, high volume interactive client/server applications Code with Vue.JS and other JavaScript libraries and have an excellent command over HTML, and CSS Work with Python on Google App Engine Cloud Datastore (NoSQL database) Memcache (distributed cache) Analysis with BigQuery Debug with StackDriver Work with real-time communication mechanisms such as WebRTC and WebSockets Interface with designers, product managers, and other engineers (our policy: with fewer organized meetings, engineers have more time to code) Launch new code weekly with our fast release cycles Owning the release of the server and client in a rotation as release engineer Improve performance to handle rapid increase in user base Writing backend and frontend unit tests Monitoring and alerts in Datadog Participating in Python and JavaScript code reviews Traits we'll look for in you We hire smart Engineers that are willing to learn new technologies and take ownership in the work they are assigned to. When it comes to your background, we are extremely flexible with industry experience and the technologies you have worked with in the past. If you like to tackle complex engineering problems, build scalable cloud-based features in a full-stack capacity and love taking features from design to production, then you are the engineer for us! Technology Stack Python, Django, JavaScript, Vue.JS, NoSQL, Google Cloud and Google App Engine. About Us Joining our team means collaborating with people that aren't just passionate about their work but about Argentine tango, musicals, sushi burritos, comic books - you name it. Because if you're going to redefine the status quo, you need a group of people hungry to do more, to see more, and be more than where they started. There is no idea too crazy and no task too small — we work together to make things we're proud of. Compensation & Equity Teamwork makes the dream work. We recognize that our dedicated team members are what make us successful. That's why we offer competitive salaries in addition to stock options. Healthcare An apple a day keeps the doctor away - and it doesn't hurt that we offer 100% paid medical, dental, and vision plans for all employees. Reimbursements We offer a monthly stipend to help cover your cell phone, home internet, and even gym membership costs. Education We believe in your future as much as you do! That's why we offer a yearly stipend for continued learning and education expenses. Office Meals Bon Appetit! Enjoy catered lunches, free snacks & drinks (both healthy and unhealthy - no judgment!) Location, Location, Location San Francisco <> San Ramon <> Austin <> Raleigh <> Vancouver <> Kitchener <> Tokyo <> New York <> Bangalore. From coast to coast, our offices are nestled in active and growing downtown areas Dialpad is an equal opportunity employer; we believe in creating a community of inclusion and an environment free from discrimination or harassment. Show moreShow less","jobBackTechs":["Java","C++","Python"],"techTypeBack":true,"jobFrontTechs":["JavaScript","VueJS"],"techTypeFront":true,"jobDevopsTechs":["Django"],"techTypeDevops":true,"link":"https://ca.linkedin.com/jobs/view/software-engineer-at-dialpad-2230311410?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Information Technology and Services, Computer Software, Internet"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Instacart","place":"Toronto, Ontario, Canada","date":"2020-10-23","description":"Overview We're looking for Software Engineers with experience building scalable applications and systems to join our fast moving team in Toronto. Software Engineers at Instacart work on a wide range of interesting and challenging problems at scale, from supporting thousands of concurrent shoppers and processing millions of data points in real-time, to building tools for ad campaigns and sign-ups. At Instacart, you will work on features that define our industry in an open and collaborative environment serving millions of requests daily! We love Software Engineers who are capable of building a solution and owning problems end-to-end. There is a tremendous amount of opportunity in front of us, and joining our team at Instacart gives you a chance to grow your career and interests, as we succeed together! About The Job You will be part of a team with a large amount of ownership, responsibility and autonomy You will work closely with Senior Engineers, Product Managers, other teams, and internal/external stakeholders, owning a large part of the process from understanding a problem to shipping the solution You will ship high quality, scalable and robust solutions with a sense of urgency You will have the freedom to suggest and drive organization-wide initiatives Instacart's technology is constantly changing and adapting. Some of the technologies you will use at Instacart include: React Ruby Python Postgres Snowflake Cypress And many others yet to come If you have experience with these technologies, you will have the opportunity to dive deeper. If you haven't used some of these technologies, you’ll have the chance to learn from the collective experience of our team. About You Bachelor’s degree in Computer Science, Computer Engineering, Electrical Engineering or equivalent 1+ years of working experience as a Software Engineer Self-motivated & enjoy working in a fast paced environment Possess a strong sense of ownership Thrive in a collaborative team environment Excited by a strong career growth opportunity Excited to adopt new technologies & skills Show moreShow less","jobBackTechs":["C++","Python"],"techTypeBack":true,"jobFrontTechs":["ReactJS"],"techTypeFront":true,"jobDevopsTechs":["Ruby"],"techTypeDevops":true,"link":"https://ca.linkedin.com/jobs/view/software-engineer-at-instacart-2205270841?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Marketing and Advertising, Computer Software, Internet"},{"query":"Software Engineer","location":"Anywhere","title":"New Grad Software Engineer","company":"Stripe","place":"Dublin, County Dublin, Ireland","date":"2020-10-24","description":"At Stripe, a core part of our engineering culture is inclusiveness: we want to accommodate people from all backgrounds and walks of life. Stripe is for the versatile, the supportive, the impatient, and most of all, the obsessively user focused. You’ll be arriving in the first chapter of our story, and you’ll be expected to play a lead role in determining how it unfolds. As a New Grad at Stripe, you’ll work on increasingly challenging projects to become an independent, high-impact software engineer. Depending upon the team, the work can focus anywhere on improving our API performance, improving the payment acceptance across the globe, or work to ensure our infrastructure is reliable enough for critical economic infrastructure. As a company, we believe in end-to-end ownership of projects. For any given project, we have one person on point. While they don’t necessarily have to do all the work themselves, it’s their job to make sure all the work gets done. We launch betas and prototypes as early as we can. This helps ensure that we’re building what users actually want. We contribute back to the community, often by building things we think are cool and by releasing open-source software. You Will Work on cross-functional projects, directly collaborating with other engineers Give meaningful feedback on code reviews and technical designs Ensure that the systems your team operates continue running well and can scale to meet the needs of our users Build the skills to own a project from beginning to end, learning project management and technical leadership skills We’re Looking For Someone With A degree in Computer Science or a directly related field by 2021, or equivalent work experience Experience either in internships, or working collaboratively on multi-person coding projects (in a university or professional setting) Ability to learn unfamiliar systems and forming an understanding of those systems, through independent research and working with a mentor and subject matter experts You Also Likely Have One or more areas of specialized knowledge in balance with general skills and knowledge, such as knowing more frontend technologies but knowing, at a high level, how a service handles an HTTP request Experience in code review practices, and an understanding of how to safely update production systems Familiarity with navigating and managing work in large code bases Please Include These In Your Application A description of your work history (either a resume, LinkedIn Profile, website, or other portfolio of work) Examples of your relevant work and approach to learning (GitHub, StackOverflow, other projects including open source contributions) Please find our EU applicant personal information notice here Show moreShow less","jobBackTechs":["C++"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":["Git"],"techTypeDevops":true,"link":"https://ie.linkedin.com/jobs/view/new-grad-software-engineer-at-stripe-2210713683?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Computer Software, Financial Services, Internet"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Amdocs","place":"Pune, Maharashtra, India","date":"2020-10-26","description":"Software Engineer Who are we? If you’re a smartphone user then you are part of an ever more connected and digital world. At Amdocs, we are leading the digital revolution into the future. From virtualized telecommunications networks, Big Data and Internet of Things to mobile financial services, billing and operational support systems, we are continually evolving our business to help you become more connected. We make sure that when you watch a video on YouTube, message friends on Snapchat or send your images on Instagram, you get great service anytime, anywhere, and on any device. We are at the heart of the telecommunications industry working with giants such as AT&T, Vodafone, Telstra and Telefonica, helping them create an amazing new world for you where technology is being used in amazing new ways every single day. In one sentence Responsible for design, development, modification, debug and/or maintenance of software systems What will your job look like? You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications. You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders. You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions. You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals. You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements. You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks. All you need is... Bachelor's degree in Science/IT/Computer Science or equivalent 3+ years Java experience (server side) on Linux/Unix/Windows Demonstrable experience with the Spring framework components - Spring Boot, MVC, Integration, Security, etc. Strong understanding of RESTful APIs and open systems Why You Will Love This Job You will be challenged to design and develop new software applications. You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth. Software Engineer Show moreShow less","jobBackTechs":["Java","C++"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":["Git","Linux"],"techTypeDevops":true,"link":"https://in.linkedin.com/jobs/view/software-engineer-at-amdocs-2241240792?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Information Technology and Services, Computer Software, Telecommunications"},{"query":"Software Engineer","location":"Anywhere","title":"SOFTWARE ENGINEER","company":"The Home Depot","place":"Atlanta, GA","date":"2020-10-22","description":"POSITION PURPOSE The Software Engineer is responsible for joining a product team and contributing to the software design, software development, and overall product lifecycle for a product that our users love. The engineering process is highly collaborative. Software Engineers are expected to pair on a daily basis as they work through user stories and support products as they evolve. In addition, Software Engineers may be involved in product configuration, performance tuning and testing as well as production monitoring. As a Software Engineer, you will be part of a team with more experienced engineers to help build and grow your skills while you create, support, and deploy production applications. MAJOR TASKS, RESPONSIBILITIES AND KEY ACCOUNTABILITIES 60% - Delivery & Execution: Collaborates and pairs with other product team members (UX, engineering, and product management) to create secure, reliable, scalable software solutions Works with Product Team to ensure user stories that are developer-ready, easy to understand, and testable Writes custom code or scripts to automate infrastructure, monitoring services, and test cases Writes custom code or scripts to do \"destructive testing\" to ensure adequate resiliency in production Configures commercial off the shelf solutions to align with evolving business needs Creates meaningful dashboards, logging, alerting, and responses to ensure that issues are captured and addressed proactively 20% - Support & Enablement: Fields questions from other product teams or support teams Monitors tools and participates in conversations to encourage collaboration across product teams Provides application support for software running in production Proactively monitors production Service Level Objectives for products Proactively reviews the Performance and Capacity of all aspects of production: code, infrastructure, data, and message processing 20% Learning: Participates in learning activities around modern software design and development core practices (communities of practice) Proactively views articles, tutorials, and videos to learn about new technologies and best practices being used within other technology organizations Reviews and discusses code from more senior engineers to understand best practices and design patterns Increases business acumen by learning about other parts of the business NATURE AND SCOPE Typically reports to the Software Engineer Manager or Sr. Manager. Environmental Job Requirements Located in a comfortable indoor area. Any unpleasant condition Travel Typically requires overnight travel less than 10% of the time. Minimum Qualifications Must be eighteen years of age or older. Must be legally permitted to work in the United States. Additional Minimum Qualifications Experience in an object-oriented programming language (preferably Java) Must be legally permitted to work Years of Relevant Work Experience: 1 plus years Physical Requirements Most of the time is spent sitting in a comfortable position and there is frequent opportunity to move about. On rare occasions, there may be a need to move or lift light articles. Located in a comfortable indoor area. Any unpleasant conditions would be infrequent and not objectionable. Knowledge, Skills, Abilities And Competencies Cultivates Innovation: Creating new and better ways for the organization to be successful Collaborates: Building partnerships and working collaboratively with others to meet shared objectives Communicates Effectively: Developing and delivering multi-mode communications that convey a clear understanding of the unique needs of different audiences Drives Results: Consistently achieving results, even under tough circumstances Show moreShow less","jobBackTechs":["Java","C++"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":[],"techTypeDevops":false,"link":"https://www.linkedin.com/jobs/view/software-engineer-at-the-home-depot-2206983399?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=16&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Construction, Information Technology and Services, Financial Services"},{"query":"Software Engineer","location":"Anywhere","title":"Engineering - Software Engineer - Backend/Server (Fresh Grad)","company":"Shopee","place":"Singapore, Singapore","date":"2020-09-28","description":"We are a group of software engineers who take coding seriously and understand programming as a science. We are responsible for the design and implementation of the services / systems / platforms with high performance, high availability and high scalability. We constantly dive into the deep layer of the code to identify and solve problems. Job Description: Design and development of backend services / systems / platforms used by our products and our user Write high-quality, clean, elegant, and maintainable code Build common libraries Analyse requirements, design and develop functionalities based on the product requirements Understand the product thoroughly, constantly optimise the product, identify and fix problems, improve stability and user experience Design and implement various supporting tools as needed Collaborate with other engineers, product managers, user experience designers, and operations engineers to build features and products Requirements: Bachelor's or higher degree in Computer Science or related fields Open for fresh grads students Passionate about coding and programming, innovation, and solving challenging problems In-depth understanding of computer science fundamentals (data structures and algorithms, operating systems, networks, databases, etc) Strong and hands-on experience with at least one of the programming languages: Go, Python, C++, Java Hands-on experiences and knowledge on relational databases such as MySQL Strong logical thinking abilities Skills below are optional but preferable: Familiar with Linux development environments and multi-threaded programming Familiar with common network protocols (TCP, UDP, HTTP) and network programming Experience in server/ web security Experience in design and development of large-scale distributed systems Hands-on experiences in Web Service frameworks and technologies such as Django, Ruby On Rails, or Node.js Familiar with performance tuning of Web Server, massive concurrency handling, and caching mechanisms Show moreShow less","jobBackTechs":["Java","C++","Python"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":["Ruby","Ruby on Rails","Django","MySQL","Linux"],"techTypeDevops":true,"link":"https://sg.linkedin.com/jobs/view/engineering-software-engineer-backend-server-fresh-grad-at-shopee-2230175496?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Marketing and Advertising, Internet, Financial Services"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Nileweb Co","place":"India","date":"2020-10-25","description":"Do you take ownership on your work, taking things beyond comfort zone with a guest to learn & and think keeping customer first? We are looking for you. We are a early stage startup who are going beyond our comfort zone, with a quest to learn and innovate and solve the end customer requirements. We can join together for this journey and make it successful, if you are interested in either Frontend development or backend development like Java Nodejs Python Golang Flutter Reactjs Angular please do reachout to us on contact@nileweb.co Responsibilities Develop quality software and applications Analyze and maintain existing software applications Design highly scalable, testable code Discover and fix programming bugs Qualifications Bachelor's degree or equivalent experience in Computer Science or related field Development experience in atleast 1 programming languages Clear understanding of SQL database or relational database skills and any NoSql database Show moreShow less","jobBackTechs":["Java","C++","GoLang","Python"],"techTypeBack":true,"jobFrontTechs":["AngularJS","ReactJS"],"techTypeFront":true,"jobDevopsTechs":[],"techTypeDevops":false,"link":"https://in.linkedin.com/jobs/view/software-engineer-at-nileweb-co-2238049237?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=18&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Information Technology and Services"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Rubrik, Inc.","place":"Palo Alto, CA","date":"2020-10-24","description":"About The Job You will design, build, and maintain reliable and efficient large-scale distributed services providing new SaaS products and features. You will own the feature end to end across across multiple stacks ( BE, FE and QA) You will Collaborate with partner teams such as Product Management, Support. You will identify and solve bottlenecks within the software stack. About You In your day-to-day work, you will leverage your past experience in developing large software systems to design, develop, test, deploy, maintain, and improve Rubrik’s products. You will manage individual projects, priorities, deadlines, and deliverables end to end with your technical expertise. You are self motivated and can work independently or partner closely with other engineers on a project.Our diverse team of engineers all bring unique experience to Rubrik. If you have all/most of these experiences, we want to hear from you. Bachelor’s or Master’s degree in Computer Science or similar technical field of study or equivalent practical experience Min. 3yrs Software development experience in one or more general purpose programming languages including but not limited to Go, Python, Scala, C/C++, JavaScript and React JS Experience building distributed systems and working with cloud technologies such as Kuberrnetes, gRPC, message queues and object-stores. About The Team You will be part of a dynamic team that’s solving toughest engineering problems in building large scale multi-cloud distributed systems. This Team is building ground-up best in class SaaS service leveraging APIs from SaaS vendors to protect and manage enterprise customer’s data. As the industry moves more towards SaaS applications in the cloud, data protection for these SaaS applications becomes a critical need for our customers. The team focuses on SaaS application protection, such as Office 365, Salesforce, etc. About Rubrik Rubrik is one of the fastest-growing companies in Silicon Valley, revolutionising data protection, and management in the emerging multi-cloud world. We are the leader in cloud data management, delivering a single platform to manage and protect data in the cloud, at the edge, and on-premises. Enterprises choose Rubrik to simplify backup and recovery, accelerate cloud adoption, enable automation at scale, and secure against cyberthreats. We’ve been recognized as a Forbes Cloud 100 Company two years in a row and as a LinkedIn Top 10 startup. Rubrik provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Rubrik complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Show moreShow less","jobBackTechs":["Java","C++","Python"],"techTypeBack":true,"jobFrontTechs":["JavaScript","ReactJS"],"techTypeFront":true,"jobDevopsTechs":["AWS"],"techTypeDevops":true,"link":"https://www.linkedin.com/jobs/view/software-engineer-at-rubrik-inc-2210734813?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=19&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Information Technology and Services, Computer Software, Internet"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Snackpass","place":"United States","date":"2020-10-23","description":"It’s such a great time to join Snackpass! We are building a way to buy anything with friends, starting with restaurant takeout on college campuses. Students use Snackpass to order ahead at local restaurants, skip the line and get discounts with their friends. After every purchase, you get a reward point for yourself and a bonus point to send to a friend. We're helping restaurants transition to digital and contactless to thrive in a post COVID world where takeout is a core pillar of every restaurant. We believe that 1. all restaurant orders will move from offline (physical credit cards) to online (digital ordering) 2. all e-commerce will go social, starting with food. In the semester we launched, over 80% of Yale student body started using Snackpass to order food. We’ve repeated our success at multiple campuses (Brown, Berkeley, Michigan, Dartmouth) and are looking to expand to 100 campuses, and then radiate into surrounding cities. We're looking for creative and ambitious people to join our team! We'd love to talk with you. Snackpass is a startup backed by Andreessen Horowitz, Y Combinator, General Catalyst and First Round Capital, the same firms who invested in Square, Uber and Airbnb. Role: Our software engineers are determined to build the most fun, convenient and social experiences for our customers. We are also building products for our restaurant partners to grow their customer base and improve their operations. At Snackpass, you will talk to customers, find and fix pain points on the fly, and build extensive internal tooling to support on-the-ground launch operations. You will be building a scalable payments platform that handles marketplace transactions between users and restaurants: automated payouts, promotions, customer analytics and acquisition tools, and recommendations. We believe operating a brick-and-mortar restaurant should be as easy as operating an online Shopify store. Most local business still run on legacy systems. At Snackpass, we are building the OS for local commerce. Requirements: • 1-3 years of relevant experience • Experience with architectural patterns of complex web applications (e.g., well-designed APIs) • Experience with modern JavaScript libraries and tooling such as React, Express & Node.js • Creative and eager to experiment • Excited about working on social graphs, well-designed infrastructure and payments, and building the next-gen consumer food and buying experience. Takes pains to write readable and maintainable code, not only own the code they wrote but also share it with the team • Ego-less, will work on whatever needs doing Our Stack: • JavaScript • React I React Native I Reason • Node.js I Express • MongoDB • Heroku I AWS • GraphQL Projects we've worked on: • Restaurant facing tools for managing their business and engaging customers • Social rewards system where you can get points for yourself and send them to friends • Algorithm for trending products • In-store self-service kiosks • Mobile app for partners to scale account management, reporting Show moreShow less","jobBackTechs":["Java","C++"],"techTypeBack":true,"jobFrontTechs":["JavaScript","ReactJS"],"techTypeFront":true,"jobDevopsTechs":["Express","MongoDB","AWS","Git"],"techTypeDevops":true,"link":"https://www.linkedin.com/jobs/view/software-engineer-at-snackpass-2208474177?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=20&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Associate","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Internet"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"WB Games","place":"Chicago, IL","date":"2020-10-01","description":"The Job Netherrealm Studios, a division of WB Games Inc., seeks a Software Engineer, Gameplay to work with the game development team responsible for Mortal Kombat and Injustice 2 to help make Netherrealm's next project its most successful to date. As a member of the game play team, you will work closely with the lead game programmer, and the game play programming team to implement new features, and support the design team in their efforts to create a compelling game experience. Your responsibilities will include AI systems, bug fixing, enemy and boss encounters, environmental interactions, and performance. As a member of the game play team, there will be many opportunities to share experience, knowledge, and expertise across the team and code base. In addition to working in a collaborative, team oriented environment, the Gameplay Engineer will also work with the Lead Game Programmer, and Director of Engineering to help determine dependencies, task, and scheduling goals. The Daily Design, implement, and maintain coding solutions. This will include collaborating with the game play team to identify areas that need work, improvements, or new solutions. Work with the design team to find creative solutions and innovative ways to meet and exceed design goals. Evaluate game code for performance bottlenecks, and work pro-actively with lead game programmer towards solutions. Work with lead on scheduling, tasks, dependencies. Attend meetings for planning, and updates. The Essentials B.S. degree in CS/EE/Math/Physics or equivalent experience 3 or more Years C/C++ Past experience engineering game play systems Experience in cross-platform development Experience with Xbox 360 and PS3 development tools One or more past shipped titles Understanding of current AI techniques (path finding, entity component systems, messaging, callbacks, etc.) Solid understanding of math and physics. Experience with performance programming (optimization, caching systems, compiler behavior, etc.) Understanding of animation systems, scripting, and associated tools. Ability to collaborate with all art, design and engineering teams to create quality, long lasting solutions. Able to work well within a team environment, as well as being self-motivated and focused. Desire to solve problems, and offer creative solutions. Strong desire to work with others to develop and ship AAA titles full-featured on time. Show moreShow less","jobBackTechs":["C++"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":[],"techTypeDevops":false,"link":"https://www.linkedin.com/jobs/view/software-engineer-at-wb-games-2240478776?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=21&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Computer Software, Entertainment, Computer Games"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Tapjoy","place":"San Francisco, CA","date":"2020-10-08","description":"Position Title: Software Engineer Position Description And Responsibilities Tapjoy is seeking a Software Engineer who will work closely with Data Scientists, Data Engineers and Ad Server Engineering teams to help productionalize, scale and support Tapjoy's Optimization platform. We are looking for someone with experience working with vast amounts of data, service scaling and low-latency applications. Essential duties and responsibilities may include, but are not limited to: Design and create a robust Data Processing Platform with high throughput Research and innovate on Big Data platform stack (Spark, Kafka, Aerospike and many others) Core Competencies Include Strong Computer Science fundamentals, including knowledge on data structure, algorithm and object-oriented design Is self-directed and self-driven Is results-oriented with a high emphasis on \"on-time\" delivery of projects and features Values collaboration with various teams and stakeholders Communicates often and well about potential roadblocks and tradeoffs between performance and complexity Requirements B.S. or M.S. in Computer Science 2+ years of Software Engineering experience Strong knowledge of data structures, SQL, software design patterns and algorithms (i.e., indexing, hash tables, joins, aggregation) Knowledge of low-latency, high-throughput services Strongly prefer someone who has had experience with big data platforms and challenges that come with large scale platforms. Bonus Points Prefer someone who understands and experiences ETL processes and concepts Prefer someone who understands general machine learning concepts Experience with advertising industry is a big plus Tapjoy is a leading mobile advertising and app monetization company. Our platform empowers advertisers to connect with over 975 million monthly active users through value exchange advertising that drives awareness, engagement and the metrics that matter most to their overall growth. Meanwhile, companies such as Scopely, Crowdstar, Topps and many of the Top 200 grossing app publishers trust our platform to monetize their content, grow their audiences and reward their users. Founded in 2007 and headquartered in San Francisco, Tapjoy is a global organization with more than a dozen offices worldwide. Tapjoy is an equal opportunity employer. We believe that diversity and inclusion lead to stronger, more innovative teams and better business results; we want to draw from the broadest talent pool possible and encourage qualified applicants. Tapjoy does not discriminate on the basis of sex, race, ethnicity, color, age, sexual orientation, gender (including identity and expression), disability (mental or physical), religion, national origin, citizenship, marital status, military or veteran status, or any other protected classification protected by applicable law; we will provide reasonable accommodations for qualified individuals with disabilities, and pursuant to applicable fair chance ordinances, we will consider for employment qualified applicants with arrest and conviction records. For more information, please visit www.tapjoy.com. Show moreShow less","jobBackTechs":["C++"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":["Express"],"techTypeDevops":true,"link":"https://www.linkedin.com/jobs/view/software-engineer-at-tapjoy-2237791626?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=22&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Marketing and Advertising, Computer Software, Internet"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer I","company":"Grubhub","place":"Chicago, IL","date":"2020-10-26","description":"Software Engineer I Job Locations US-IL-Chicago Job ID 2020-10295 Category University About The Opportunity About The Opportunity Grubhub is dedicated to connecting hungry diners with our wide network of restaurants across the country. Our innovative technology, easy-to-use platforms and streamlined delivery capabilities make us an industry leader today, and in the future of online food ordering. We strive to create a workplace that reflects the diversity of our customers and the communities we serve. When you join our team, you become part of a community that works together to innovate, solve problems, take risks, grow, work hard and have a ton of fun in the process! Why Work For Us We have a fast-paced environment and that is what our teams thrive on. Grubhub believes in empowering people and offering opportunities for development, as well as professional growth. We value strong, positive relationships in all areas: with each other, our customers and our greater community. Want to be a part of a team of diverse collaborators in an authentically fun culture? If so, we want to talk to you - and hear what’s your favorite restaurant for food delivery! The Impact You Will Make Design, implement, and deliver awesome technical platforms and products for all constituencies (diners, corporate accounts, restaurants, internal tools) Understand our products from both a technical and business perspective in the context of our larger business. Communicate with leadership, product owners, other technologists, and users to create working software based on an understanding of business and technical priorities. Break down complex problems into elegant technical solutions to intelligently solve problems for diners, restaurant, corporate accounts and internal stakeholders. Actively contribute to the adoption of strong software architecture, development best practices, and new technologies. We are always improving the process of building software; we need you to help contribute. You will be a key part in accurately estimating the timing of software delivery. What You Bring To The Table Bachelor’s Degree in Computer Science, Software Engineering or related field Strong track record of strong academic performance (3.0 or higher cumulative GPA) Solid foundation in software programming in one or more of the following languages: Java, Python, C, C++, Ruby, Scala, C#, Objective C Eagerness to contribute in a team-oriented environment Ability to work creatively and analytically in a problem-solving environment Familiar with Agile software development methodologies Interested in working for a fast paced tech and product oriented company And Of Course, Perks! Flexible PTO. Grubhub employees are provided a generous amount of time to recharge their batteries. Health and Wellness. We provide programs that support your overall well-being such as generous medical benefits, employee network groups, company-wide fitness challenges, and a comfortable and casual workplace! We also support our parents by offering 8 weeks of paid parent bonding time, a 4-week returnship program, and 6-8 weeks paid medical leave. Learning and Career Growth. Your personal and professional development is a priority at Grubhub. From day one, we empower you to lead and be an active participant in your career growth. We provide continuous learning opportunities, training, and coaching and mentorship programs. MealPerks. Who’s ready for some lunch? We provide our employees with a weekly Grubhub credit to enjoy and support local restaurants. We also offer company-wide meals several times a year to bring our Grubhub family together. Fun. Every Grubhub office has an employee-led Culture Crew that connects people through fun, meaningful events and initiatives. Some of our popular past events include: Wing-eating contests, Grubtoberfest, 5k Runs, Bring Your Child to Work Day, regular happy hours, and more! Social Impact. We believe in the importance of serving the communities that support our business. In addition, employees are given paid time off each year to support the causes that are important to them. Grubhub is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. The EEO is the Law poster is available here: DOL Poster . If you are applying for a job in the U.S. and need a reasonable accommodation for any part of the employment process, please send an e-mail to TalentAcquisition@grubhub.com and let us know the nature of your request and contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this email address. CA Privacy Notice: If you are a resident of the State of California and would like a copy of our CA privacy notice, please email privacy@grubhub.com. Connect With Us! Not ready to apply? Connect with us for general consideration. Show moreShow less","jobBackTechs":["Java","C#","C++","Python"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":["Ruby"],"techTypeDevops":true,"link":"https://www.linkedin.com/jobs/view/software-engineer-i-at-grubhub-2213598695?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Marketing and Advertising, Computer Software, Internet"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Cabify","place":"Madrid, Community of Madrid, Spain","date":"2020-09-28","description":"Do you want to help us to change the world? At Cabify and Movo, We aim to make cities better places to live by improving mobility for the people living in them, connecting riders to drivers, providing mobility alternatives such as kick-scooter and mopeds and many others to come, at the touch of a button. Maybe one day cities will be places where nobody needs a private car. But we've still got a long way to go...fancy joining us? Our Product & Engineering teams include an eclectic bunch of awesome and diverse people from different backgrounds who come together as collaborative and inclusive teams to push boundaries. Right now, we have more than 20 million users around the world. We work across 11 countries and 90 cities, adapting our product fast to be leaders in all of those markets and taking care about sustainability. We're working on some pretty greenfield projects with a solid set of product ideas lined up. We are looking for committed and proactive people who want to keep learning constantly and also, help us to grow technically and humanly working in collaboration with awesome people, and making an impact across our teams. Having a diverse and inclusive work environment is really important for us. That's why we like to count with different points of view in our team that help us to solve problems in a better way. We are looking for engineers with experience working with any backend technology, though we use Go, Elixir and Ruby for our day to day work. We believe that even if you have worked in other programming languages such as Java all your life you can still pick up Elixir or Go pretty quickly. For us, it is more important to have someone who is adaptable and can pick up languages quickly. You will: Work on cross-team, impactful projects. Lead parts of these projects helping your team to deliver in a fast, reliable and high-quality way. Work on building and maintaining distributed applications. Improve reliability, scalability and performance of our services so they always meet their SLAs. Develop new features, tweak existing ones in a data-driven fashion in collaboration with our Data Science team. Produce simple, maintainable code while always looking to improve on it. Own your code all the way to production with a self-service continuous delivery pipeline and production infrastructure. Run what you build using bleeding edge container orchestration and monitoring technologies. Our Ideal candidate has: Great alignment with our values, we take this very seriously. Sound knowledge of common algorithms & data structures. Experience in developing medium/large-scale web applications and distributed systems in a production environment. Experience with common design and architectural patterns. Ability to work independently, but being a good team player too. Ability to understand and help to make great product and business decisions. Ability to achieve results in a fast-paced, changing environment. A willingness to work with Ruby code occasionally is a plus! Experience slaying monoliths is a plus! What's it like to work at Cabify? We're a company full of happy, motivated people and we never want that to change. Here are some more reasons why it rocks to be part of our family. Excellent Salary conditions at Engineering: Junior 24k-30k, Mid 30k-48k. We also offer a very competitive stock options plan. At Cabify we strongly believe highly committed, vision-aligned key roles must be long term investment in the company success, thus a significant portion of the compensation of roles such as this one goes in the form of stock options. We offer a relocation package to people who are coming from another country. Our office is located in Madrid, but a fully remote position is also available for this role. Two Remote days available per week if you are working in our Madrid office. Flexible work environment & hours Regular team events Cabify staff discount Personal development programs based on our career paths Training programs Flexible compensation plan: Subsidized restaurant tickets, transport tickets, healthcare and childcare A pet room so you don't have to leave your furry friend at home And last but not least...free coffee and fruit! Aren't you sure about if you fulfill all of the requirements? Even, if this position stands out your curiosity, please apply for it. At Cabify we believe that professional development happens through teaching and learning from your peers and managers. Cabify is proud of being an equal opportunity workplace. We celebrate diversity and we are committed to creating an inclusive environment for all employees regardless of background, gender, religion, orientation, age or ability. Join us! Show moreShow less","jobBackTechs":["Java","C++","Python"],"techTypeBack":true,"jobFrontTechs":[],"techTypeFront":false,"jobDevopsTechs":["Ruby"],"techTypeDevops":true,"link":"https://es.linkedin.com/jobs/view/software-engineer-at-cabify-2233119137?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Marketing and Advertising, Internet, Human Resources"},{"query":"Software Engineer","location":"Anywhere","title":"Software Engineer","company":"Tesla","place":"Fremont, CA","date":"2020-09-29","description":"THE ROLE As a Software Engineer you’ll take part in the design and development of software for the current and next generation of Tesla’s Enterprise Resource Planning systems. In this role, you’ll be developing highly complex applications with a team goal of streamlining business operations and improving overall user experience. The ideal candidate is a self-starter with a strong desire to increase efficiencies, and make an impact while contributing to a cross-functional team. Your ability to creatively collaborate and execute team goals will affect scalabiliy and directly contribute to the company mission of accelerating the world’s transition to sustainable energy. Responsibilities Work with experienced engineers across many functional areas to deliver business value to internal and external stakeholders. Design and develop new modules on the home grown ERP application Warp which is used to plan, procure and produce cars. Develop scalable solutions using tools like Angular, C# .net, MySQL and other open stack frameworks. Know your app! Seek to understand all aspects, business and technical, of the applications on which you work so that you can be most effective. Contribute towards the timely completion of development tasks and small projects while applying company standards. Continually learn and apply relevant software development practices, patterns, tools and technologies. Increase efficiency, reduce waste wherever and whenever possible. Requirements 4+ years in web application development, including: Implementing Application Programming Interfaces (APIs), Object Oriented Programming and Design (OOP&D), Object Relational Mapping (ORM) Experience in frontend development, using tools such as: JavaScript, Angular, React, etc. Experience in backend development, using tools such as: C#, Java, Go, Ruby, etc. Relational databases, SQL, NoSQL Agile Development Distributed Source Control, using tools such as: Git Education: BS/MS in Computer Science or equivalent degree. Employee Benefits As a full time Tesla employee you will receive full benefits from day 1 for you and your dependents. Kaiser and UnitedHealthcare PPO and HSA plans (including infertility coverage) 3 medical plan choices with $0 paycheck contribution Vision & dental plans (including orthodontic coverage) Company paid Life, AD&D, short-term and long-term disability 401(k), Employee Stock Purchase Plans, and other financial benefits Employee Assistance Program, Paid Time Off, and Paid Holidays Back-up childcare and employee discounts Show moreShow less","jobBackTechs":["Java","C#","C++"],"techTypeBack":true,"jobFrontTechs":["JavaScript","AngularJS","ReactJS"],"techTypeFront":true,"jobDevopsTechs":["Ruby","MySQL","Git"],"techTypeDevops":true,"link":"https://www.linkedin.com/jobs/view/software-engineer-at-tesla-2210795862?refId=b58b47e4-f1c6-42f3-b622-399161e73233&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click","senorityLevel":"Entry level","jobFunction":"Engineering, Information Technology","employmenttype":"Full-time","industries":"Automotive, Renewables & Environment, Utilities"}]